{"date": "31/03/2024", "job_list": [{"title": "Software Development QA", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionFortinet is looking for a Software Dev QA to join our UI (User interface) Development team to focus on GUI automation testing. As a team member, you will be responsible for writing automated tests for various web applications including FortiOS, FortiSASE SIA, and FortiGate Cloud GUI . You will be working closely with the interface development team to verify new features, automate test cases and improve interface usability and performance.   This is an exciting opportunity to work with the latest in web application and networking technologies, such as Security Fabric, Next Generation Firewall, Unified Threat Management, Cloud Security, VPN, Wireless access, and other advanced Firewall features.   To find out more about what it is like working for the team, watch this video - https://www.youtube.com/watch?v=zx56_G2RnjE    Job Responsibilities:     • Automate front-end testing using Selenium (Java) and other automation frameworks.   • Measure coverage and effectiveness of automated tests, and strive for continual improvements.   • Execute feature and bug fix testing using a combination of manual and automated testing techniques.   • Identify, document, and track software defects found during testing.   • Work closely with developers to ensure defects are correctly identified and fixed.   • Improve testing and development processes using various automation techniques.     Job Skills Required:     • 2 years + working experience with Selenium (Java) or similar automation tools.   • Solid networking knowledge (IP stack, Routing, NAT, Firewall).   • Experience in software testing including Web application and API testing.   • Knowledge of general QA procedures and methodologies, as well as software development fundamentals.   • Demonstrated ability to logically and analytically troubleshoot Web application.   • Demonstrated ability to write clear and reproducible problem reports, and test results.   • Experience with code review systems and bug tracking services is an asset.   • Experience working in a Linux environment.     Educational Requirements:     • A degree or technical diploma in Computer Science, Computer Technology, or related field.   #GD #LI-CN1\n\n                    Category\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "Principal Software Development Engineer", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionFortinet is calling for an experienced Senior Software Developer who can think outside the box, has a logical approach to coding, and is looking to grow their career in the network security industry. Responsibilities:   •Work with the Product Management teams on the product roadmaps, new features design, and product certifications  •Work with R&D and QA throughout the product development lifecycle  •Develop pre- and post-sales tools and environments  •Research new technologies and trends to be familiar with and be able to devise new solution  Requirements:   •Proficient in C language, proficient in development tools and environments under LINUX, such as gcc gdb libc, etc., able to understand GNU Makefile.  •Deep knowledge of the HTTP/HTTPS protocol  •Familiarity with network firewalls, IDS/IPS, VPN, security consulting, SSL, IPsec  •Familiarity with common Web Authentication protocols, like NTLM, HTTP Basic, Radius, LDAP.  •Experience with common web servers and proxies(like Nginx/Apache/Haproxy)  •Understanding of Web application vulnerabilities, OWASP top 10  •Extensive experience in a pre- and post-systems engineering  •Experience with containers and Kubernetes  •High self-learning abilities  #GD #LI-ELENASH\n\n                    Category\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "Embedded SW Developer (BSP/Bootloader)", "company": "Great Canadian Gaming Corp.", "date": "Mar. 24, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\n Embedded SW Developer (BSP/Bootloader) # 60776 About the Job:  Mindwire is seeking a skilled embedded software developer that is experienced in the areas of BSP and secure bootloaders for our valued Private Sector client. The range of projects the candidate will be working on will be infotainment, connectivity and other HW modules.  The position is located in Ottawa/Oakville/Waterloo   Work Environment - Hybrid  Responsibilities:  •  Design and implement BSP/bootloader features as part of a larger team-based software project  •  Design and implement secure boot features  •  Create software design documents  •  Participate in design reviews  •  Assist with product verification and validation, troubleshooting and testing  •  Communicate problems early to team members and offer solutions     Requirements and Qualifications:  • Bachelor's degree in Computer Science, Electrical Engineering or equivalent field of study • 2+ years experience in the design and development of BSP and bootloaders • Proven C and assembly language experience • Must have experience completing at least 2 board bring ups • Capable of reading electronic schematics   How to Apply: Online:  To apply for this and other suitable exciting opportunities with Mindwire Systems Ltd., you can apply online through the button on the top right. E-mail:  Please email Jordan at Jordan.Krusch @mindwire.ca   We thank all applicants for their interest; however only those candidates selected for interviews will be contacted. \nCategory\n Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Full Time", " Information Technology"]}, {"title": "Senior Programmer Analyst", "company": "BCLC", "date": "Mar. 26, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\n                    Senior Programmer Analyst Location:   Remote within, BC, CA Job Function:  Information Technology  BCLC exists to generate win-wins for the greater good.     For our people, our players, our communities, our industry, and our planet.     Lottery | Casino | Sports  Being a social purpose company, we are not only able to better align our business decisions with our purpose, but more importantly, we are committing to doing our part in creating a better world.   We bring our purpose to life by ensuring all our actions, behaviours and decisions create benefits for communities and the planet.  Motivated and guided by our social purpose, everything we do must benefit the greater good. And we encourage our employees, partners, players, industry and communities to engage with us on this ambition.    We want you to be where you feel you can do your best work. This job can be done remotely providing you reside in BC.           For those who prefer working in a community with others, we have two beautiful offices in convenient locations:            2940 Virtual Way, Vancouver | 74 Seymour Street W, Kamloops   This is a Permanent, Full Time opportunity Expected Salary Range: $70,177.00 - $87,722.00 - $109,652.00            Our typical hiring range will be +/- 10% of the midpoint shown above           Factors influencing this decision include qualifications and market conditions for the role    The Company    For over three decades, BCLC has delivered exceptional gambling entertainment for British Columbians. To fulfill our social purpose we have a vision to revolutionize gambling entertainment through engaging experiences that build and benefit communities. We operate national and provincial lotteries in partnership with 3500 retail partners, provide the games, technology & oversight to 37 brick & mortar casinos, and operate a safe secure and 100% legal online gambling presence PlayNow.com. In our recently completed fiscal year, BCLC generated a record $1.6 billion in net income to the Province of B.C. to support First Nations, local host governments, health care, education and community programs across the province.   Job Summary:   As a key member of the Retail Partnership Team, the role of the Senior Programmer Analyst is to work with other Developers and Operations staff to build, deploy, and support Integration services in BCLC's Lottery ecosystem. This role will proactively resolve complex technical issues and use innovative thinking in the development and delivery of solutions and broader issues resolution. The Senior Programmer Analyst role acts as a consultative partner providing expertise, analysis, and advice to internal stakeholders within BCLC. They will work with external partners in a multivendor environment to enable the business to provide Lottery products and services efficiently and effectively.   Accountabilities:   Design Complex Software Components: Take a leading role in designing and architecting software solutions that meet specified requirements.   Advanced Coding and Implementation: Write sophisticated code to implement software designs, ensuring scalability, performance, and maintainability.   Technical Problem Solving: Address complex technical issues independently, demonstrating a high level of problem-solving capability.   Collaboration and Mentorship: Collaborate effectively with team members, product owners, vendors, and stakeholders; providing guidance to junior engineers, and contributing to a positive team dynamic.   Code Reviews and Quality Assurance: Conduct and participate in thorough code reviews to ensure code quality, adherence to best practices, and knowledge sharing within the team.   System Optimization: Optimize and enhance existing software systems for improved performance, efficiency, and overall effectiveness.   Adopt Advanced Technologies: Stay abreast of emerging technologies, tools, and development methodologies, incorporating them into projects where appropriate.   Contribute to Technical Documentation: Document software architecture, design decisions, and coding standards to facilitate knowledge transfer and future maintenance.   Automation and Process Improvement: Maintaining, enhancing, and identifying opportunities for continuous improvement of software delivery processes.   Minimum Required Qualifications: Education and Experience    University degree or certification in Computer Science or equivalent experience;   3-5 years progressively more responsible experience in a programming/analysis environment, with at least three years at a programmer/analyst level;    Experience working on large projects with high levels of integration;   Experience with implementation and maintaining of large systems would be an asset;   Equivalent combination of education and/or experience will be considered.   Technical Requirements   Knowledge of Multiple Programming languages: Java Spring Boot, .Net Framework (including C#, ASP.NET), Java/J2EE, SQL, XML, HTML;   Knowledge of Containerization: OpenShift, Docker;   Knowledge of Automation: Jenkins Pipeline, CICD;   Knowledge of AWS Cloud Products: EC2, S3, API Gateway, MQ, SNS/SQS, etc   Knowledge of Agile processes and ceremonies;   Knowledge of Middleware: Webservices, Microservices, REST, SOAP;   Knowledge of Database: Microsoft SQL Server;    Knowledge of Microsoft Windows systems, system administration, would be an asset;   Excellent interpersonal skills;   Excellent written and verbal communication skills;   Excellent problem solving and analytical thinking/innovation;   Strong computer skills - MS office suite;   Exceptional time management and multi-tasking skills.   What's in it for you   Defined benefit pension plan which provides a recurring income you can depend on for life throughout retirement   We pride ourselves on our flexible working model which supports work-life integration and our 37.5 hour work week   Professional development including education/certification sponsorship, in house leadership cohorts, LinkedIn Learning   See all our rewards  here   However you identify, or whatever your path in life, if you see something here that makes you excited to get to work every day, please apply. We hire people for skills, capabilities and potential, not just education and experience.    We value Respect, Integrity and Community, and we provide an inclusive environment where everyone can feel like they belong .    Our social purpose is much more than returning 100% of net income to the province in the form of healthcare & education programs, and community gaming grants. Check it out !    Did you know BCLC is an industry leader in player health and safe & responsible gambling? Find out more !    We are trained in neurodivergent hiring. If you require accommodation so you can be at your best in the interview, please let us know: recruitment@bclc.com .   All candidates must be at least 19 years of age and legally eligible to work in Canada  \nCategory\n Information Technology\n", "details": ["\n\n                                4 days ago\n                            ", " Full Time", " Information Technology"]}, {"title": "Account Executive", "company": "Elastic Path Software", "date": "Mar. 24, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\nDescription   What to expect as an Account Executive at Elastic Path?   As an Account Executive at Elastic Path you'll possess a strong track record of driving strategic software solutions, and can hit the ground running with previous sales experience in SaaS or eCommerce. You will be a most trusted advisor to our current and prospective customers, as you will ensure to deeply understand their unique challenges and goals, and recommend strategic software solutions for their business. You will define and implement a strategy for an assigned region/s. You will be an integral part of mentoring sales reps and BDRs, and contribute to the continuous growth and enablement of our Sales organization.   Our Account Executives create business value at all levels, manage complex sales cycles in collaboration with partners and deliver consistent results independently and as part of a team. They are empowered by autonomy, and supported by a leading product, company and culture.   Location:  This is a remote role based in Canada or the United States - candidates are required to be located in North America to be considered. Elastic Path is a Remote First employer, so you'll have the tools to support you to work from wherever you are based.  Key Responsibilities:   Facilitate, shape, direct and negotiate license (and sometimes services) engagement proposals to ensure effective delivery which meets business goals for Elastic Path and the client  Discover, create, and close new license opportunities  Build and maintain detailed account profiles and plans as well as construct and forecast budgets for all client accounts  Conduct target account prospecting and sales calls to key decision makers, C level and technical influencers within potential client organizations by establishing a \"trusted advisor\" relationship  Ensure post-implementation customer satisfaction  Actively participate in contract negotiations with Sales and technical solutions services team on prospect/new client accounts  Provide solid expertise of technical solutions in ecommerce and its delivery  Work closely with professional services and client success management to ensure successful proposals and projects  Understand and apply Elastic Path security policies, processes, and controls as required, in day-to-day tasks.  What experience do you need to Be Remarkable in this position?    An ability to evangelize about eCommerce, its power and potential to clients  7+ years of high-tech sales experience and owning a quota focused on selling software licenses and professional services  A proven track record of exceeding expectations and an aggressive attitude towards discovery, prospecting, planning and closing  Deep understanding of the local markets and the ability to adapt to work across verticals and geographies  Ability to thrive in a dynamic and entrepreneurial environment, and eagerness to navigate into uncharted territory  Resilient nature and strong objection handling skills  Possess a strong business acumen and can clearly articulate ROI  Strong team player with excellent communication skills  Ability and willingness to travel as required, approximately 25-50% of the time.  Who we are:   Elastic Path is on a mission to break through the barriers that prevent commerce leaders from delivering extraordinary shopping experiences. Today, that means making  Composable Commerce  accessible to all brands by reducing the cost, time, and overall risk of implementing and managing a multi-vendor approach. With Elastic Path, both business and tech teams are able to innovate on their own terms, fully embrace composability, and in turn, never compromise on what's possible. Learn more at  www.elasticpath.com  .   Be Open. Be Remarkable. Be the Team. Be the Customer. The values we live by.   The Perks?   At Elastic Path we are on a mission to provide pay transparency, and share information freely and openly whenever possible.   The base salary for this position ranges from $ 127,560 -175,395 USD OR 105,813 - 145,493 CAD per annum. Compensation is determined through interviews and a review of education, experience, knowledge, skills, abilities of each applicant, equity with other team members, and alignment with market data. In addition to base salary, this role includes a commission structure based on the attainment of sales targets. Commissions are added to base salary, and once combined, referred to as On Target Earnings.   We go the extra mile to provide you & your family with exceptional benefits, wherever you may be located. This includes paid vacation and sick leave, stock options, full extended health, dental and additional coverages.     You'll get access to annual stipends for your own professional development, remote working and more.   We are a Remote-First company, however we have five office hub locations in our major cities. If you live in proximity to one of our Hubs you'll have the option to flex between remote and in-office if desired!  We provide solutions to bring all teams together for collaboration and connection throughout the year.   We have a Work from Anywhere program that gives you the freedom to work from anywhere in the world, for up to 3 months within a 12 year period. Talk about travel perks!  You can check out all this and more about us on our careers page .  Apply Now!  Elastic Path is an equal opportunities employer and prohibits discrimination and harassment of any kind. We value and celebrate diversity in its many forms, and we strive to provide an inclusive and safe workplace where each person feels respected, supported, and accepted - however they choose to identify.   Disclaimer:  Please be aware of targeted employment scams. If you are being considered for a position with Elastic Path, you will always receive direct communications from us via our ATS Jobvite, or our personal Elastic Path domain email addresses; [email protected] .\n\n                    Category\n Sales and Marketing\n", "details": ["\n\n                                6 days ago\n                            ", " Full Time", " Sales and Marketing"]}, {"title": "Software Development QA", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionFortiSASE SIA is a SaaS-based service that combines network and security functions with WAN capabilities, which allows users to securely access the Internet from anywhere. As a team member, you will be responsible for testing the end-to-end functionality of the product. You will be working closely with multiple development and QA teams to verify new features, regression test existing functionalities and improve the product's usability, reliability, and performance.  Job Responsibilities Execute feature and bug fix testing for the FortiSASE SIA application using a combination of manual and automated testing techniques.    • Automate front-end testing using Selenium (Java).   • Identify, document, and track software defects found during testing.   • Work closely with developers to ensure defects are correctly identified and fixed.  Job Skills Required Experience in software testing, including web application and REST API testing.     • Knowledge of TCP/IP networking, firewalls, switching, and routing.   • Knowledge of general QA procedures and methodologies, as well as software development fundamentals.   • Team player with strong interpersonal, written, and verbal communication skills.   • Demonstrated ability to logically and analytically troubleshoot web applications.   • Demonstrated ability to write clear and reproducible problem reports and test results.   • Experience with SaaS products is an asset.   • Experience with Selenium (Java) is an asset.   • Experience with endpoint software (such as FortiClient or equivalent) is an asset   • Experience with code review systems and bug tracking services is an asset.  Educational Requirements A degree or technical diploma in Computer Science, Computer Technology, or related field.    #GD   #LI-CN1\n\n                    Category\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "Senior Consultant, Privacy Engineer", "company": "Deloitte", "date": "Mar. 24, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\nJob Type:Permanent Reference code:125367 Primary Location:Toronto, Ontario, Canada All Available Locations:Toronto, ON  Our Purpose At Deloitte, we are driven to inspire and help our people, organization, communities, and country to thrive. Our Purpose is to build a better future by accelerating and expanding access to knowledge. Purpose defines who we are and gives us reason to exist as an organization.Have many careers in one Firm. Partner with clients to solve their most complex problems Be expected to share your ideas and to make them a reality.Join Deloitte Canada's Risk Advisory, Data Protection and Privacy team as a Data Privacy Solution Engineer and shape the future of privacy automation.What will your typical day look like? As a Data Privacy Solution Engineer, you will be at the forefront of Deloitte's mission to ensure data privacy and protection. Your day will revolve around designing, developing, and implementing software solutions that meet our complex clients' privacy requirements. You will be responsible for SaaS implementations, integrating marketing platforms, managing databases, and enhancing client architectures. Your expertise in privacy tools and software engineering concepts will be vital as you navigate through tasks in a fast-paced, Agile environment.  Tasks and Responsibilities: • Develop and implement solutions to ensure privacy policies are correctly implemented. The implementations should advance compliance with legal forms of data use as well as support business use of data. • Work to align advanced technologies and Privacy by Design principles from the first stages of development and ensure that the data use meets established regulatory compliance needs. • Collaborate with data product development teams creating new uses of data that employ privacy features. • Interacting with internal privacy program managers, product development teams, legal, compliance, governance and data protection teams. • Analyze, design and program software enhancements for new data streams with a goal of developing technical solutions and systems to help mitigate privacy vulnerabilities and prevent potential future privacy risks. • Responsible for assisting with the management of the data privacy, data protection, data usability, performance and the integrity of the privacy solution. • Using current programming language and technologies, creates a solid design, writes code, completes programming, and performs testing and debugging of applications as well as completes documentation and procedures for installation and maintenance. • Interact with users to define system requirements and/or necessary modifications to new or existing software. • Interface with other developers and architects in implementing big data solutions that enable the business to be data driven while protecting the data assets. • Interface with usability team to ensure user-facing privacy controls are usable • Use data anonymization, pseudonimization and encryption to develop systems that preserve and improve privacy protections. • Guide the development of new privacy products and features. • Identify areas of improvement in local practices relative to managing data privacy. • Performs regular privacy assessments of operational processes, identifying, and mitigating risks across the company through effective tools, training and guidance • Communicates program progress, escalations, and issue analysis to key stakeholders • Acts as key interface to data science and analytics communities both within and outside of the organizationAbout the team Our Privacy and Data Protection team, part of Deloitte Canada's Risk Advisory service line, is a dynamic group of professionals dedicated to ensuring the privacy and safety of our clients' data. We work with a diverse range of technologies and tools to design and implement data privacy solutions. We value collaboration, continuous learning, and innovation. As part of our team, you will have the opportunity to work on challenging projects, develop your skills, and make a significant impact on our clients' businesses.Enough about us, let's talk about you You are someone who has:• Excellent analytical and problem solving skills. • Excellent communication skills (verbal and written), ability to influence without authority. • Ability to balance risks in ambiguous and complex situations. • Demonstrated teamwork and collaboration skills, in particular in leading or contributing to global and multi-functional teams. • Highly motivated to contribute and grow within a complex area of emerging importance. • Experience or understanding of software applications design tools and languages • Understanding of design for software applications running on multiple platforms. • Understanding of testing, coding and debugging procedures. • Demonstrated working knowledge of software engineering fundamentals. • Competent in the interpretation of numeric data, an understanding of statistical principles. • Data literacy: finding and managing data, cleansing data, manipulating data. • Ability to perform operations on large datasetsQualifications: • BS or MS degree in computer science, computer engineering, information systems, privacy engineering or related field of study. • Strong software development skills. • Exposure to any privacy automation solution a plus (Onetrust, BigID, Ketch ... etc.) • Excellent communication and presentation skills and the ability to effectively communicate designs, proposals, and results; and negotiate options at management levels • 5 years' experience in privacy / data protection or a graduate degree or concentration in privacy engineeringTotal RewardsThe salary range for this position is $83,000 - $125,000, and individuals may be eligible to participate in our bonus program. Deloitte is fair and competitive when it comes to the salaries of our people. We regularly benchmark across a variety of positions, industries, sectors, targets, and levels. Our approach is grounded on recognizing people's unique strengths and contributions and rewarding the value that they deliver.Our Total Rewards Package extends well beyond traditional compensation and benefit programs and is designed to recognize employee contributions, encourage personal wellness, and support firm growth. Along with a competitive base salary and variable pay opportunities, we offer a wide array of initiatives that differentiate us as a people-first organization. Some representative examples include: $4,000 per year for mental health support benefits, a $1,300 flexible benefit spending account, 38+ days off (including 10 firm-wide closures known as \"Deloitte Days\"), flexible work arrangements and a hybrid work structure.Our shared values While our Purpose guides us and helps explain why we exist, our shared values describe the behaviour we expect from each other at the firm. They provide common ground to unite us across cultures and geographies. They help us to earn the trust and respect of our stakeholders. We all commit to living by these shared values, to stay true to the principles they represent, and to honour the legacy from which they came. They are what sets us apart and makes us Deloitte. Every day, we live our Purpose through the following five shared values:  Lead the way:Deloitte is not only leading the profession, but reinventing it for the future. We're also committed to creating opportunity and leading the way to a more sustainable world.  Serve with integrity:Deloitte has earned the trust of employees, clients, regulators, and the public for 175 years. Upholding that trust is our single most important responsibility.  Take care of each other:We look out for one another and prioritize respect, fairness, development, and well-being.  Foster inclusion:We are at our best when we foster an inclusive culture and embrace diversity in all forms. We know this attracts top talent, enables innovation, and helps us deliver well-rounded client solutions.  Collaborate for measurable impact:We approach our work with a collaborative mindset, teaming across businesses, geographies, and skill sets to deliver tangible, measurable, attributable impact. The next step is yours  Sound like The One Firm. For You?  At Deloitte, we are all about doing business inclusively - that starts with having diverse colleagues of all abilities. Deloitte encourages applications from all qualified candidates who represent the full diversity of communities across Canada. This includes, but is not limited to, people with disabilities, candidates from Indigenous communities, and candidates from the Black community in support of living our values, creating a culture of Diversity Equity and Inclusion and our commitment to our AccessAbility Action Plan , Reconciliation Action Plan and the BlackNorth Initiative . We encourage you to connect with us at accessiblecareers@deloitte.ca if you require an accommodation for the recruitment process (including alternate formats of materials, accessible meeting rooms or other accommodations). We'd love to hear from you! By applying to this job you will be assessed against the Deloitte Global Talent Standards. We've designed these standards to provide our clients with a consistent and exceptional Deloitte experience globally. Deloitte Canada has 30 offices with representation across most of the country. We acknowledge our offices reside on traditional, treaty and unceded territories as part of Turtle Island and is still home to many First Nations, Métis, and Inuit peoples. We are all Treaty people.Job Segment:  Test Engineer, Marketing Consultant, Compliance, Testing, Software Engineer, Engineering, Marketing, Legal, Technology\n\n                    Category\n Management and Executive\n", "details": ["\n\n                                6 days ago\n                            ", " Full Time", " Management and Executive"]}, {"title": "Senior Kernel Developer", "company": "Great Canadian Gaming Corp.", "date": "Mar. 24, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\n Senior. Kernel Developer Job#61146   About the Job:  Mindwire is currently seeking a Senior Kernel Developer to work for our valued private sector client.   The position is located in Ottawa, ON  Responsibilities:   •  Exploring the real-time OS research or development targeting embedded devices, cloud & virtualized computing and automotive domain.  •  Contribute and help build the next-generation real-time OS technology to power a broad range of compute platforms.  •  Solve some very challenging problems around scheduling, resource allocation, isolation and IPC in very complex systems use cases.  •  Focus on developing tooling and solutions to performance challenges in the system     Requirements and Qualifications:   •  Expert level of experience and expertise in the field of real-time operating system design, development and integration.  •  Expert level of system software development (mainly C/C++).  •  Expert level CPU architecture knowledge for system software development.  •  Strong ability to research complex topics, distill knowledge into concrete designs and apply to new or existing projects.  •  Strong communication ability to document and present technical information and solutions effectively to both technical and non-technical audiences.     How to Apply:  Online:  To apply for this and other suitable exciting opportunities with Mindwire Systems Ltd., you can apply online through the button on the top right. E-mail:  Please email Jennilee Cook at jennilee.cook@mindwire.ca    We thank all applicants for their interest, however only those candidates selected for interviews will be contacted. \nCategory\n Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Full Time", " Information Technology"]}, {"title": "Delivery Associate Director", "company": "NTT DATA", "date": "Mar. 24, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\nReq ID: 260738   NTT DATA Services strives to hire exceptional, innovative and passionate individuals who want to grow with us. If you want to be part of an inclusive, adaptable, and forward-thinking organization, apply now.   We are currently seeking a Delivery Associate Director to join our team in Vancover, British Columbia (CA-BC), Canada (CA).  • Leads and directs Delivery area which provides services to clients in connection with the design, development and implementation of IT solutions using software / hardware systems or the integration of software / hardware systems or professional IT solutions services.  • Provides strategic direction and oversight in developing teams' capabilities, achieving financial and operational objectives and successfully delivering on client commitments.  • Develops the Delivery line of business and drives consistent processes and practices around the world.  • Manages a staff of professional-level team members or manages a team through lower-level supervisors.  • Works within general policies and management guidance, independently determining approach to managing daily operations.  • Provides guidance and technical advice, becoming actively involved as necessary.   • Provides leadership, direction, and oversight of activities such as system design and analysis, applications and system programming, database management, network systems, telecommunications, and data processing operations.   • Recruits, manages, and develops management teams.  • Has primary responsibility for overseeing the technical design and delivery of strategic outsourcing engagements.   • Works with Marketing and Sales teams to execute sales strategies.  •Proof of COVID vaccination is required to be on-site.  Skills:  • 10 years of Project Management  • 10 years of Advanced influencing and communication skills.  • 10 years of advanced client service skills and leadership capabilities.  • Advanced knowledge, understanding, and application of project management principles and methodologies.   • Excellent analytical / problem-solving skills.  • Excellent organizational and time management skills.  • Excellent budgeting, business financial, and P&L skills.  • Ability to develop comprehensive and complex operational and strategic plans   #INDICS   About NTT DATA Services    NTT DATA Services is a recognized leader in IT and business services, including cloud, data and applications, headquartered in Texas. As part of NTT DATA, a $30 billion trusted global innovator with a combined global reach of over 80 countries, we help clients transform through business and technology consulting, industry and digital solutions, applications development and management, managed edge-to-cloud infrastructure services, BPO, systems integration and global data centers. We are committed to our clients' long-term success. Visit nttdata.com or LinkedIn to learn more.    NTT DATA Services is an equal opportunity employer and considers all applicants without regarding to race, color, religion, citizenship, national origin, ancestry, age, sex, sexual orientation, gender identity, genetic information, physical or mental disability, veteran or marital status, or any other characteristic protected by law. We are committed to creating a diverse and inclusive environment for all employees. If you need assistance or an accommodation due to a disability, please inform your recruiter so that we may connect you with the appropriate team.  Job Segment:  Telecom, Telecommunications, Cloud, Project Manager, Application Developer, Technology\n\n                    Category\n Telecommunications\n", "details": ["\n\n                                6 days ago\n                            ", " Full Time", " Telecommunications"]}, {"title": "OpenText Technical Specialist", "company": "Deloitte", "date": "Mar. 29, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\nJob Type:Permanent Work Model:Hybrid Reference code:125990 Primary Location:Montreal, QC All Available Locations:Montreal, QC  Our Purpose   At Deloitte, we are driven to inspire and help our people, organization, communities, and country to thrive. Our Purpose is to build a better future by accelerating and expanding access to knowledge. Purpose defines who we are and gives us reason to exist as an organization. By living our Purpose, we will make an impact that matters.  Learn from deep subject matter experts through mentoring and on the job coaching. Be encouraged to deepen your technical skills...whatever those may be. Partner with clients to solve their most complex problems Be empowered to lead and have impact with clients, our communities and in the office. What will your typical day look like? By joining our team, you will contribute to our shared success and that of our clients. A key role in our Content Services practice to support clients in the scoping, design and implementation of content services solutions. You'll build lasting relationships with our team, while being integrated into sales cycles, delivery and the growth of our practice. You'll have the opportunity to work with us on various projects, engaging directly with clients, and delivering services with quality. Your passion for emerging technologies for clients will be an asset, driving your delivery as you leverage your skills and experience to adapt to various roles and clients. You will be involved in advancing the business by helping clients identify their needs, craft deliverables, provide recommendations to clients, and participating in practice development efforts.With us, you will lead at every level. You'll deliver client mandates, contribute to end-to-end advisory services, while learning and leveraging industry best practices. With our diverse team of talented professionals, you will contribute to the satisfaction of our clients, while we support your career growth and skills development.Your passion for lifelong learning means you'll continue to expand your knowledge, learn from others, and seek continuous opportunities to grow.About the team Our Content Services practice helps client with their end-to-end journey from upfront strategy through to implementation and operations. In this role, you will be helping to build our sales pipeline, engaging clients to present Deloitte's thought leadership, educating them on the \"art of possible\" and advising them to implement solutions and business processes that get to desired tangible outcomes. You will have an opportunity to work with industry experts, business stakeholders, and project delivery teams in a fast paced and collaborative environment. You will grow as a leader, as well as mentor others on their career path. We work with different vendors in the marketplace to bring the right solutions and capabilities to the table for our clients.  We are a team that values continuous learning, coaching and mentorship, supporting each practitioner to recognize their full potential.Enough about us, let's talk about you You are someone who is:  OpenText Content Server/Content Suite/Extended ECM experienced developer, administrator and architect.  Experience with one or many: OpenText VIM, Info Archive, Document Presentment, Exstream.  Exposure and/or experience in one of the following subject areas is an asset:  Content services strategy Data archiving Technology innovation ideation, evaluation, and adoption Enterprise architecture User Experience (UX)   5-7 years of hands-on technology implementation experience, including some or all of:  OpenText Script development OpenText Technology: Content Server, Archive Center/Server, Directory Services OpenText application components: web reports, live reports, forms, form templates, workflows SAP ABAP development Object oriented programming, preferably Java or .NET. Front-End (JavaScript, HTML, CSS) development Web Services (REST, SOAP) development Experience with various aspects of technology solution implementation, such as:   Technical specification development Feature implementation and unit testing COTS software platform installation and configuration with specific experience around OpenText applications Data / information model development Data / content migration Knowledge of data integration tools and platforms such as Microsoft SQL Server Integration Services (SSIS), OpenText Magellan Integration Center or similar Understanding of relational DB fundamentals including data modelling and design, and performance troubleshooting Understanding of web application technologies and architectures OpenText certifications will be considered an asset. Able to conceive and communicate new ideas and conceptualize innovative approaches and solutions. Bilingualism (English, French) will be considered an asset. College, bachelor's degree or equivalent work experience with specialization in Management Information Systems, Computer Science, Software Engineering or other IT related disciplines  Total RewardsThe salary range for this position is $84,000 - $175,000, and individuals may be eligible to participate in our bonus program. Deloitte is fair and competitive when it comes to the salaries of our people. We regularly benchmark across a variety of positions, industries, sectors, targets, and levels. Our approach is grounded on recognizing people's unique strengths and contributions and rewarding the value that they deliver.Our Total Rewards Package extends well beyond traditional compensation and benefit programs and is designed to recognize employee contributions, encourage personal wellness, and support firm growth. Along with a competitive base salary and variable pay opportunities, we offer a wide array of initiatives that differentiate us as a people-first organization. Some representative examples include: $4,000 per year for mental health support benefits, a $1,300 flexible benefit spending account, 38+ days off (including 10 firm-wide closures known as \"Deloitte Days\"), flexible work arrangements and a hybrid work structure.Our promise to our people: Deloitte is where potential comes to life.   Be yourself, and more. We are a group of talented people who want to learn, gain experience, and develop skills. Wherever you are in your career, we want you to advance. You shape how we make impact. Diverse perspectives and life experiences make us better. Whoever you are and wherever you're from, we want you to feel like you belong here. We provide flexible working options to support you and how you can contribute. Be the leader you want to be. Be the leader you want to be  Some guide teams, some change culture, some build essential expertise. We offer opportunities and experiences that support your continuing growth as a leader. Have as many careers as you want. We are uniquely able to offer you new challenges and roles - and prepare you for them. We bring together people with unique experiences and talents, and we are the place to develop a lasting network of friends, peers, and mentors. Our TVP is about relationships - between leaders and their people, the firm and its people, peers, and within in our communities.The next step is yours   At Deloitte, we are all about doing business inclusively - that starts with having diverse colleagues of all abilities. Deloitte encourages applications from all qualified candidates who represent the full diversity of communities across Canada. This includes, but is not limited to, people with disabilities, candidates from Indigenous communities, and candidates from the Black community in support of living our values, creating a culture of Diversity Equity and Inclusion and our commitment to our AccessAbility Action Plan , Reconciliation Action Plan and the BlackNorth Initiative .  We encourage you to connect with us at accessiblecareers@deloitte.ca if you require an accommodation for the recruitment process (including alternate formats of materials, accessible meeting rooms or other accommodations) or indigenouscareers@deloitte.ca for any questions relating to careers for Indigenous peoples at Deloitte (First Nations, Inuit, Métis). By applying to this job you will be assessed against the Deloitte Global Talent Standards. We've designed these standards to provide our clients with a consistent and exceptional Deloitte experience globally. Deloitte Canada has 30 offices with representation across most of the country. We acknowledge our offices reside on traditional, treaty and unceded territories as part of Turtle Island and is still home to many First Nations, Métis, and Inuit peoples. We are all Treaty people.Job Segment:  Test Engineer, Testing, Developer, User Experience, Software Engineer, Engineering, Technology\n\n                    Category\n Information Technology\n", "details": ["\n\n                                2 days ago\n                            ", " Full Time", " Information Technology"]}, {"title": "Client User Identity and Access Management Platform Operations Lead, Deloitte Global Technology", "company": "Deloitte", "date": "Mar. 24, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\n                    Deloitte Global is the engine of the Deloitte network. Our professionals reach across disciplines and borders to develop and lead global initiatives. We deliver strategic programs and services that unite our organization.    Work you'll do     In this interesting and diverse role, you'll be leading efforts to drive operational excellence for the Client-User Identity and Access Management solution utilized by Deloitte clients to authenticate to Deloitte solutions.   Manage operational support team.   Manage data collection for the updating of metrics to achieve productivity targets, reduce cost per unit, eliminate errors, and deliver excellent customer service   Manage the application source code and source code based configuration management systems, Continuous Deployment (CD) pipelines, test automation frameworks, and functional testing suites   Stay up-to-date on new technologies and automation techniques to improve the quality and efficiency of our technology operations   Manage all production escalations received from various sources   Identify the business impact of each escalation to determine Priority   Host the Bi-Weekly Meetings with the Business to discuss status of various production changes   Acts as a back- up Communication Officer in sending out notification of Priority 1 and Priority 2 incidents to selected Distribution Lists   Ensure all change requests and defects are recorded   Responsible for coordinating after-hours implementation activities   Support the Business, Application Managers, and client's in resolving production issues  About the teamDeloitte Technology works at the forefront of technology development and processes to support and protect Deloitte around the world. In this truly global environment, we operate not in \"what is\" but rather \"what can be\" to help Deloitte deliver and connect with its clients, its communities, and one another in ways not previously conceived. Enough about us, let's talk about youDo you possess the following experience?:     5+ Years hands on experience with Operations of Mission Critical Software Infrastructure   Experience in technical support, QA, or workflow support   Must be able to context-switch and manage multiple partners in parallel across various implementation stages   Experience working with version control software, ADO, GitHub   Participate in a 24x7x365 on-call rotation   BS/BA degree or equivalent experience   Prior Big 4 experience  Total RewardsThe salary range for this position is $85,000 - $156,000, and individuals may be eligible to participate in our bonus program. Deloitte is fair and competitive when it comes to the salaries of our people. We regularly benchmark across a variety of positions, industries, sectors, targets, and levels. Our approach is grounded on recognizing people's unique strengths and contributions and rewarding the value that they deliver.Our Total Rewards Package extends well beyond traditional compensation and benefit programs and is designed to recognize employee contributions, encourage personal wellness, and support firm growth. Along with a competitive base salary and variable pay opportunities, we offer a wide array of initiatives that differentiate us as a people-first organization. Some representative examples include: $4,000 per year for mental health support benefits, a $1,300 flexible benefit spending account, 38+ days off (including 10 firm-wide closures known as \"Deloitte Days\"), flexible work arrangements and a hybrid work structure.Job Segment:  Testing, QA, Quality Assurance, Operations Manager, Technology, Quality, Operations\n\n                    Category\n Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Full Time", " Information Technology"]}, {"title": "Systems Engineer", "company": "BCLC", "date": "Mar. 28, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\n                    Systems Engineer Location:   Remote within, BC, CA Job Function:  Information Technology  BCLC exists to generate win-wins for the greater good.     For our people, our players, our communities, our industry, and our planet.     Lottery | Casino | Sports  Being a social purpose company, we are not only able to better align our business decisions with our purpose, but more importantly, we are committing to doing our part in creating a better world.  We bring our purpose to life by ensuring all our actions, behaviours and decisions create benefits for communities and the planet.  Motivated and guided by our social purpose, everything we do must benefit the greater good. And we encourage our employees, partners, players, industry and communities to engage with us on this ambition.     We want you to be where you feel you can do your best work. Most of our jobs can be done remotely providing you reside in BC.     For those who prefer working in a community with others, we have two beautiful offices in convenient locations:                     2940 Virtual Way, Vancouver | 74 Seymour Street W, Kamloops     This is a Permanent, Full Time opportunity     Expected Salary Range: $82,108.00 - $102,635.00 - $128,294.00                     Our typical hiring range will be +/- 5% of the midpoint shown above                     Factors influencing this decision include qualifications and market conditions for the role    The Company    For over three decades, BCLC has delivered exceptional gambling entertainment for British Columbians. To fulfill our social purpose we have a vision to revolutionize gambling entertainment through engaging experiences that build and benefit communities. We operate national and provincial lotteries in partnership with 3500 retail partners, provide the games, technology & oversight to 37 brick & mortar casinos, and operate a safe secure and 100% legal online gambling presence PlayNow.com. In our recently completed fiscal year, BCLC generated a record $1.6 billion in net income to the Province of B.C. to support First Nations, local host governments, health care, education and community programs across the province.   Job Summary:   As a member of Digital Enablement the Systems Engineer - Development acts as a senior technical resource in the area of software development, systems architecture, design, and translating business and technical requirements into services and solutions.  They fill a role as a technical and cultural leader on the team and consistently demonstrates the required behaviors on the team.   This role partners with diverse stakeholders including Product Owners, Agile Coaches, Project Managers, Enterprise Architects, Capability Managers and business stakeholders, as well as a broad range of technical and business subject matter experts including external vendors and consultants.     The Systems Engineer - Development facilitates delivery by collaborating with team members to develop and adopt technology and processes to increase operational agility throughout the solution lifecycle. They proactively develop and implement best practices to address emerging trends in the industry and the evolving needs of our business partners. The role drives delivery of services and solutions used by internal and external customers.   Key Accountabilities:   As a senior technical persona, the role will take on technical leadership duties. The role will collaborate with business and technical leadership to ensure the successful delivery of enterprise solutions by removing blocking issues and providing direction to technical members of the product team.    Partners with the Product Owner and business stakeholders to understand the customer need, build and support customized demos, and to assist in the development of the long-term product roadmap.    Aligns business strategy and technology to create solutions that are cost effective to implement and relevant to our business and customer needs   Collaborates with the Capability Manager, Product Owner, and Product Team to define functional and non-functional requirements to a sufficient level of detail to ensure services are secure, flexible, open, scalable, available, testable and maintainable within a high-volume, mission-critical production environment.   Ensures the successful development, quality assurance, implementation, and ongoing support requirements of the designed solutions.   Collaborates with Enterprise Communities of Excellence (COE) to provide significant input and recommendations on Architecture Strategy, Enterprise Domain Roadmaps, Principles, Standards, and Reference Architectures throughout the organization.   Will lead and participate in other technology COE's or Communities of Practice (COP) and develop Proof of Concepts (POC) as required to progress technology roadmaps and adoption, ensuring alignment with industry methodologies, technology trends, and innovation.    Coordinates vendors, B2B partners, and internal and product teams to map, design, document, deploy and launch technical solutions   Creates, documents and communicates technical solutions using agreed upon standard documentation processes and ensuring adherence to technical guidelines and standards.     Proactively resolves complex issues and demonstrates innovative thinking by regularly making recommendations for new approaches to technical work and broader issues resolution.   Researches technology providers and emerging technology to provide advice and recommend solutions and opportunities to business and technology stakeholders.    Ensures the implementation of technical solutions in adherence with the Enterprise Architecture Principles, Security Standards, Corporate Strategy, and Technology Roadmaps.   Contributes to the development and delivery of Business Cases and other financial documents.   Completes analysis as required to ensure BCLC is managing financial risk by making sound technology decisions.   Participate in major Procurement competitions as a Subject Matter Expert to complete technology and vendor analysis and contribute to product/vendor selection.     Minimum Required Qualifications:  Education and Experience    University Degree, College Diploma in Information Technology supplemented by industry recognized professional courses;    4-6 years progressively responsible technical experience with at least three years at a senior level in Information Technology in medium to large sized environments   Scrum Master, TOGAF, and other professional certifications would be an asset;   An equivalent combination of education and/or experience may be considered.    Technical Requirements    Excellent interpersonal skills   Excellent written and verbal communication skills   Excellent problem solving and analytical thinking/innovation   Exceptional time management and multi-tasking skills   Software integration experience   Vendor management experience   Demonstrated experience in business and process analysis and improvement   Understanding of object-oriented programming methodologies    Understanding of B.C. gaming industry is an asset   Demonstrated team leadership skills including the ability to act as a change agent to champion continuous change and improvement.   Good understanding of technology life cycle financial requirements, from procurement through to evergreen.    Software integration experience, experience in analysis, design, development and deployment of complex technology solutions involving highly secure and scalable on-line transaction processing, client/server, web and native applications in both on premise and cloud based environments.   Knowledge of best practices of IT solutions life cycle and operations in an always up, always-available service including solution performance development, monitoring and auditing tools.    Experience with containerization platforms such as Docker and OpenShift.   Strong understanding of CI/CD toolsets (strong knowledge of Jenkins a bonus)   Strong understanding of source code and artifact management and repositories   Ability to use a wide variety of open source technologies and cloud services (AWS and Azure a bonus)   General knowledge of cloud organizations and services (AWS and Azure) preferred   Understanding of Agile methodologies an asset   Strong understanding of SDLC and release management   What's in it for you   Defined benefit pension plan which provides a recurring income you can depend on for life throughout retirement   We pride ourselves on our flexible working model which supports work-life integration and our 37.5 hour work week   Professional development including education/certification sponsorship, in house leadership cohorts, LinkedIn Learning   See all our rewards  here   However you identify, or whatever your path in life, if you see something here that makes you excited to get to work every day, please apply. We hire people for skills, capabilities and potential, not just education and experience.    We value Respect, Integrity and Community, and we provide an inclusive environment where everyone can feel like they belong .    Our social purpose is much more than returning 100% of net income to the province in the form of healthcare & education programs, and community gaming grants. Check it out !    Did you know BCLC is an industry leader in player health and safe & responsible gambling? Find out more !    We are trained in neurodivergent hiring. If you require accommodation so you can be at your best in the interview, please let us know: recruitment@bclc.com .   All candidates must be at least 19 years of age and legally eligible to work in Canada  \nCategory\n Information Technology\n", "details": ["\n\n                                2 days ago\n                            ", " Full Time", " Information Technology"]}, {"title": "Geotechnical Tailings Engineer - Western Canada", "company": "WSP Canada", "date": "Mar. 24, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\nThe Opportunity:  At WSP, we're continuing to grow and develop our expertise in Mining, operating as a trusted advisor and technical expert on engineering design challenges for our clients across multiple industries. Our team is growing, and as a result we're adding Mine Tailing Engineers to our group.  As part of the Mine Waste team in Western Canada you'll be responsible for driving forward our ambitious plans to enhance our Mine service offering in the province through your work with a close-knit team of engineering specialists, professionals, and technical staff.  We offer attractive pay, flexible work options, a great corporate culture, comprehensive and employee-focused benefits including virtual healthcare and a wellness platform as well as great savings programs, and a clear vision for the future.  A day in the life:   Support a wide variety of tailings storage facilities and waste rock spoils projects, including and dam safety inspections and reviews, field investigation, laboratory testing and interpretation, design and construction.   Participate in project tasks such as geotechnical analysis (e.g., stability, seepage, thermal, tailings deposition), interpretation of data, development of recommendations, and preparation of proposals and reports for tailings storage facilities and waste rock spoils.   Be part of a team that delivers high quality work and reports to the client on time and within budget under the direction of senior engineers.   Collaborate with mining teams from different disciplines.   Mentor and effectively delegate work to junior engineers.   Participate in and promote a safety-first culture.  What you'll bring to WSP ...   1 to 5 years of relevant (post-degree) experience working in a consulting engineering or mining industry environment.   Bachelor's Degree in Civil or Geological Engineering, post-graduate degree is an asset.   Eligible to register or currently registered as a Professional Engineer in a Canadian province or territory.   Strong technical writing, interpersonal communication, and emotional intelligence.   Ability to establish and maintain good relationships with clients and colleagues.   Be able to work in and/or lead diverse teams and collaborate with interdisciplinary project teams.   Strong, client-focused project management skills.   Sound knowledge in soil mechanics and geotechnical engineering.   Ability to think critically and problem solve.   Ability to effectively delegate work.   French or Spanish language skills (verbal and written) would be an asset.   Commitment to safe work practices for yourself and your colleagues.   Advanced experience with MS Excel and VBA customization would be an asset.   Experience with tailings deposition software (Muk3D) would be an asset.   Experience with mine planning software (MineScape, MineSight, Surpac), AutoCAD, Civil3D would be an asset. Compensation Expected Salary (all locations): $62,600 - $106,400WSPCanadais providing the compensation range that the company in good faith believes it will pay for this position based on the successful applicant's education, experience, knowledge, skills, abilities in addition to the specific geographic location. #WeAreWSP  #GlobalMining  #LI-GBL WSP  is one of the world's leading professional services firms. Our purpose is to future proof our cities and environments. We have over 65,000 team members across the globe. In Canada, our 12,000+ people are involved in everything from environmental remediation to urban planning, from engineering iconic buildings to designing sustainable transportation networks, from finding new ways to extract essential resources to developing renewable power sources for the future. At WSP: We value our people and our reputation We are locally dedicated with international scale We are future focused and challenge the status quo We foster collaboration in everything we do We have an empowering culture and hold ourselves accountable Please Note:Health and Safety is a core paramount value of WSP. Given the importance of keeping one another safe it is expected that you comply with our Health, Safety & Environment (HSE) policy at all times as well as client HSE policies when working at client locations. Offers of employment for safety-sensitive positions involving fieldwork are contingent upon candidates being able to perform key physical tasks of the job as described in the job posting and interview. This may include the ability to work in a variety of environmental conditions, such as remote or isolated areas, working alone, and in inclement weather (within safe and reasonable limits).  WSP welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process.  WSP is committed to the principles of employment equity. Only the candidates selected will be contacted. WSP does not accept unsolicited resumes from agencies. For more information please READ THE FULL POLICY. \nCategory\n Engineering\n", "details": ["\n\n                                6 days ago\n                            ", " Full Time", " Engineering"]}, {"title": "DevSec Ops, Cyber Risk, Consultant/Senior Consultant", "company": "Deloitte", "date": "Mar. 30, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\nJob Type:Permanent Reference code:125939 Primary Location:Toronto, Ontario, Canada All Available Locations:Toronto, ON  Our Purpose  At Deloitte, we are driven to inspire and help our people, organization, communities, and country to thrive. Our Purpose is to build a better future by accelerating and expanding access to knowledge. Purpose defines who we are and gives us reason to exist as an organization.Have many careers in one Firm. Partner with clients to solve their most complex problems Be expected to share your ideas and to make them a reality.In a rapidly changing world where information has a significant value, supply chains are interconnected and there is uncertainty when doing business on a global basis, information security and privacy have become board level issues.What will your typical day look like? Our national practice is growing and we are seeking a new Consultant/Senior Consultant to join our talented team! As a Consultant/Senior Consultant, you will:• Work with a diverse team of talented cyber security professionals across Canada • Work with unique clients with a diverse range of technology and cyber needs • Design, define and improve secure software development lifecycle (SSDLC) procedures and processes to meet based policies and standards • Develop and implement security requirements, controls, processes/procedures for DevSecOps and CI/CD pipelines. These can involve developing Security-as-Code (SaC) as well as embedding security into Infrastructure-as-Code (IaC) as part of DevOps pipelines • Collaborate with development teams to establish secure coding practices and secure code patterns. • Work with delivery and project managers to review scope, plans, epics, stories and tickets and provide security feedback. • Be a member of the incident response and resolution efforts related to security events or concerns identified during the DevSecOps process. • Help develop a training program for product managers on security-related aspects of requirements scoping. • Develop a training program for developers on security-related aspects of DevSecOps, fostering a culture of security awareness and responsibility. • Help automate secure code testing and code analysis as part of our deployment pipelines and experience with version control system (such as GitHub, Gitlab, Bitbucket, etc.). • Experience with any of the following would be an asset: o Docker and/or Docker Enterprise or containerization technologies o Kubernetes o Ansible o Azure DevOps or similar pipeline/orchestration platforms o Commercial and open source SAST and DAST tools (e.g. OWASP ZAP, Veracode, CheckMarx, Sonatype, Fortify, Burp, etc.) o Knowledge of industry frameworks involving application security (NIST SSDF, OWASP SAMM, BSIMM, etc...)About the team Deloitte's Cyber Risk Services helps our clients to be Secure, Vigilant and Resilient in the face of an ever increasing array of cyber threats and vulnerabilities. Our Cyber Risk practice helps organizations with the management of information and technology risks by delivering end-to-end solutions, using proven methodologies and tools. Our services help organizations address timely and pervasive issues such as identity theft, data security breaches, data leakage, cybersecurity, and system outages across organizations of various sizes and industries, with the goal of enabling ongoing, secure, and reliable operations across the enterprise. The environment at Deloitte is made up of intellectually curious, smart people; including world class security and privacy experts. Your mix of work will help foster your leadership skills and you will develop relationships with a team that you respect and have fun with. In addition, you will have the opportunity to identify areas of work that are of particular interest to you.Enough about us, let's talk about you You are someone with: • Minimum 4 years of relevant work experience in application security or DevSecOps • Undergraduate degree/diploma in Software Development/Engineering, or Computer Science • Expertise in source code reviews and run-time analysis • Proficiency in scripting and programming languages and experience with automation tools. • Self-directed, with the ability to thrive in a fast-paced and dynamic environment • Strong analytical and problem solving skills, and the ability to articulate complex concepts in a clear and concise manner. • Strong understanding of AWS build and deploy tooling (DevOps toolset) • Some understanding of containerization technologies • Understanding of infrastructure-as-code and Security-as-Code • Knowledge of secure coding practices • Knowledge of common and popular code security testing tools. • Excellent problem-solving, analytical, and communication skills. • Ability to collaborate effectively with multidisciplinary teams in an agile environment. • Leadership experience with a proven ability to mentor and guide team members.Total RewardsThe salary range for this position is $66,000 - $125,000, and individuals may be eligible to participate in our bonus program. Deloitte is fair and competitive when it comes to the salaries of our people. We regularly benchmark across a variety of positions, industries, sectors, targets, and levels. Our approach is grounded on recognizing people's unique strengths and contributions and rewarding the value that they deliver.Our Total Rewards Package extends well beyond traditional compensation and benefit programs and is designed to recognize employee contributions, encourage personal wellness, and support firm growth. Along with a competitive base salary and variable pay opportunities, we offer a wide array of initiatives that differentiate us as a people-first organization. Some representative examples include: $4,000 per year for mental health support benefits, a $1,300 flexible benefit spending account, 38+ days off (including 10 firm-wide closures known as \"Deloitte Days\"), flexible work arrangements and a hybrid work structure.Our shared values  While our Purpose guides us and helps explain why we exist, our shared values describe the behaviour we expect from each other at the firm. They provide common ground to unite us across cultures and geographies. They help us to earn the trust and respect of our stakeholders. We all commit to living by these shared values, to stay true to the principles they represent, and to honour the legacy from which they came. They are what sets us apart and makes us Deloitte. Every day, we live our Purpose through the following five shared values:  Lead the way: Deloitte is not only leading the profession, but reinventing it for the future. We're also committed to creating opportunity and leading the way to a more sustainable world.  Serve with integrity: Deloitte has earned the trust of employees, clients, regulators, and the public for 175 years. Upholding that trust is our single most important responsibility.  Take care of each other: We look out for one another and prioritize respect, fairness, development, and well-being.  Foster inclusion: We are at our best when we foster an inclusive culture and embrace diversity in all forms. We know this attracts top talent, enables innovation, and helps us deliver well-rounded client solutions.  Collaborate for measurable impact: We approach our work with a collaborative mindset, teaming across businesses, geographies, and skill sets to deliver tangible, measurable, attributable impact. The next step is yours   Sound like The One Firm. For You?  At Deloitte, we are all about doing business inclusively - that starts with having diverse colleagues of all abilities. Deloitte encourages applications from all qualified candidates who represent the full diversity of communities across Canada. This includes, but is not limited to, people with disabilities, candidates from Indigenous communities, and candidates from the Black community in support of living our values, creating a culture of Diversity Equity and Inclusion and our commitment to our AccessAbility Action Plan , Reconciliation Action Plan and the BlackNorth Initiative .  We encourage you to connect with us at accessiblecareers@deloitte.ca if you require an accommodation for the recruitment process (including alternate formats of materials, accessible meeting rooms or other accommodations). We'd love to hear from you! By applying to this job you will be assessed against the Deloitte Global Talent Standards. We've designed these standards to provide our clients with a consistent and exceptional Deloitte experience globally. Deloitte Canada has 30 offices with representation across most of the country. We acknowledge our offices reside on traditional, treaty and unceded territories as part of Turtle Island and is still home to many First Nations, Métis, and Inuit peoples. We are all Treaty people.Job Segment:  Cyber Security, Testing, Information Security, Open Source, Risk Management, Security, Technology, Finance\n\n                    Category\n Management and Executive\n", "details": ["\n\n                                21 hours ago\n                            ", " Full Time", " Management and Executive"]}, {"title": "ServiceNow GRC/IRM Developer, Deloitte Global Technology", "company": "Deloitte", "date": "Mar. 24, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\nWhat will your typical day look like? In this role, you will: •Create, configure, and customize ServiceNow applications for new and existing implementations. •Create and configure functional data such as Notifications and Service Level Agreements. •Create and configure script objects such as Business Rules, Script Includes, UI Policies and Actions, Client Scripts, ACLs. •Set-up interfaces between ServiceNow and other platforms in line with integration opportunities identified by Solution Architects. •Perform system and integration testing. •Recommend Administration settings and best practices. •Create documentation of the developments, unit test cases and implementation plans. •Work effectively in diverse teams within an inclusive team culture where people are recognized for their contribution.About the team Deloitte Technology works at the forefront of technology development and processes to support and protect Deloitte around the world. In this truly global environment, we operate not in \"what is\" but rather \"what can be\" to help Deloitte deliver and connect with its clients, its communities, and one another in ways not previously conceived.Enough about us, let's talk about you Required •At least 5-6 years of ServiceNow experience, including custom development, configuration. •At least 2-3 years of ServiceNow GRC/IRC experience. •ServiceNow scripting experience using JavaScript, HTML, CSS, XML and REST/SOAP Web Services. •Understanding and experience of Business Rules, Script Includes, UI Actions and all scripted aspects of ServiceNow. •Customize ServiceNow UI and Service Portal through use of UI pages, CMS, CSS and Service Portal widgets. •Working knowledge of integrations and migrations. •Deep understanding of ITIL. •Working understanding of ServiceNow administration settings and deep functional and technical knowledge of the ServiceNow platform as well as experience delivering medium to large-scale ServiceNow implementations. •Comfort working in an agile environment with constant feedback and interaction with the team and ability to work under high pressure. •Demonstrated ability to troubleshoot technical issues. Preferred •Experience working with geographically distributed and culturally diverse work groups. •Advanced written and verbal communication skills with the ability to present to IT and business leaders. •Demonstrated ability to stay current with development best practices, existing and emerging technology platforms, and industry trends. •Experience with formal software development methodologies, with a focus on Agile. •ServiceNow Certified Systems Administrator is a must. •ServiceNow Implementation Specialist & CAD is a great bonus.Total RewardsThe salary range for this position is $58,000 - $96,000, and individuals may be eligible to participate in our bonus program. Deloitte is fair and competitive when it comes to the salaries of our people. We regularly benchmark across a variety of positions, industries, sectors, targets, and levels. Our approach is grounded on recognizing people's unique strengths and contributions and rewarding the value that they deliver.Our Total Rewards Package extends well beyond traditional compensation and benefit programs and is designed to recognize employee contributions, encourage personal wellness, and support firm growth. Along with a competitive base salary and variable pay opportunities, we offer a wide array of initiatives that differentiate us as a people-first organization. Some representative examples include: $4,000 per year for mental health support benefits, a $1,300 flexible benefit spending account, 38+ days off (including 10 firm-wide closures known as \"Deloitte Days\"), flexible work arrangements and a hybrid work structure.Job Segment:  Testing, XML, Developer, Drafting, CAD, Technology, Engineering\n\n                    Category\n Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Full Time", " Information Technology"]}, {"title": "Lead Geotechnical Engineer - Vancouver (Lower Mainland)", "company": "WSP Canada", "date": "Mar. 24, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\n                    We are a global leader in the Earth and Environment sector. Globally headquartered in Montreal, we proudly serve communities from coast to coast and beyond. We are 14,000 multidisciplinary professionals worldwide collaborating to protect and conserve natural landscapes, create firm foundations for communities to stand on, and champion sustainable development to combat climate change. As part of the team, you will have access to an unparalleled network of resources, expertise, and endless opportunities to collaborate on exciting projects with diverse teammates from marine biologists to geophysicists to geotechnical engineers and more.The Opportunity:WSP is currently seeking a highly motivated Lead Geotechnical Engineer to our Ground Engineering and Materials Team in Vancouver, BC. You will be part of a large, highly successful team, using your skills to assist in the management of various large-scale projects throughout BC and Yukon.Responsibilities will include: Working collaboratively with engineering staff on geotechnical consulting projects; Sharing technical knowledge across geographical boundaries to foster innovative project solutions; Leading and preparing geotechnical studies and engineering reports providing recommendations on various geotechnical aspects in projects, based on studies and project-specific work; Providing geotechnical engineering expertise to support multi-disciplinary projects such as highways, bridges, buildings, dams, industrial infrastructure, tunneling, etc.; Developing and leading projects requiring geotechnical investigation programs, prepare bidding documents, solicit bids, evaluate subcontractor submissions and support project engineers as part of their mandate; Assessing and evaluating geotechnical issues encountered, such as: settlements, liquefaction potential, slope stabilization, interstitial overpressure development, preferential flow, frost heave, excavation and backfilling procedures, etc.;  Supporting field operations through supervision and monitoring of boreholes, in situ tests, piezocone soundings, reconnaissance trenches, as well as miscellaneous construction work such as soil embankment construction, subgrade compaction assessment, installation of geosynthetics, etc and Other tasks as needed as part of your role in the team.We'd love to hear from you if you have... A degree in Geotechnical Engineering from an accredited university. Registered, or eligible to be registered, as a P.Eng. with EGBC. A minimum of ten (10) years of relevant experience as a Geotechnical Engineer, Geomechanics Engineer, or related position. Knowledge of standard geotechnical software such as GeoStudio, Ensoft, Rocscience , or other similar software suites. Sense of initiative and be self-directed. Strong track record of managing and completing projects on time and on budget. Ability to perform critical evaluation of outputs for geotechnical analyses.CompensationExpected Salary (all locations): $ 99,300 - $ 168,900WSP Canada is providing the compensation range that the company in good faith believes it will pay for this position based on the successful applicant's education, experience, knowledge, skills, abilities in addition to the specific geographic location. WSP  is one of the world's leading professional services firms. Our purpose is to future proof our cities and environments. We have over 65,000 team members across the globe. In Canada, our 12,000+ people are involved in everything from environmental remediation to urban planning, from engineering iconic buildings to designing sustainable transportation networks, from finding new ways to extract essential resources to developing renewable power sources for the future. At WSP: We value our people and our reputation We are locally dedicated with international scale We are future focused and challenge the status quo We foster collaboration in everything we do We have an empowering culture and hold ourselves accountable Please Note:Health and Safety is a core paramount value of WSP. Given the importance of keeping one another safe it is expected that you comply with our Health, Safety & Environment (HSE) policy at all times as well as client HSE policies when working at client locations. Offers of employment for safety-sensitive positions involving fieldwork are contingent upon candidates being able to perform key physical tasks of the job as described in the job posting and interview. This may include the ability to work in a variety of environmental conditions, such as remote or isolated areas, working alone, and in inclement weather (within safe and reasonable limits).  WSP welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process.  WSP is committed to the principles of employment equity. Only the candidates selected will be contacted. WSP does not accept unsolicited resumes from agencies. For more information please READ THE FULL POLICY. \nCategory\n Engineering\n", "details": ["\n\n                                6 days ago\n                            ", " Full Time", " Engineering"]}, {"title": "Senior Manager, Digital & Automation, AOA- Future Opportunity", "company": "Deloitte", "date": "Mar. 26, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\nJob Type:Permanent Work Model:Hybrid Reference code:125984 Primary Location:Toronto, ON All Available Locations:Burlington, ON; Calgary, AB; Edmonton, AB; Fredericton, NB; Halifax, NS; Kitchener, ON; Moncton, NB; Ottawa, ON; Regina, SK; Saint John, NB; Saskatoon, SK; St. John's, NL; Toronto, ON; Vancouver, BC; Victoria, BC; Winnipeg, MB  Our Purpose   At Deloitte, we are driven to inspire and help our people, organization, communities, and country to thrive. Our Purpose is to build a better future by accelerating and expanding access to knowledge. Purpose defines who we are and gives us reason to exist as an organization. By living our Purpose, we will make an impact that matters.  Learn from deep subject matter experts through mentoring and on the job coaching Build your leadership skills at Deloitte University. Have many careers in one Firm Are you looking for a new opportunity in technology? Do you want to continue your professional development to reinforce and expand your chosen career path? Take a look at this exciting position! What will your typical day look like?  As a Senior Manager in Digital & Automation Advisory, with a focus on Controllership Automation you will review and contribute to the planning and execution of projects primarily associated with BlackLine & Workiva implementations, contribute to business development, keep current on new software functionality and its proper use and applications, review client deliverables prepared by junior staff and develop staff skillsets related to: technical knowledge, communication skills, leadership and project management.   You will also have opportunities to serve clients and / or support local office teams around the country and / or internationally, contribute to market and eminence initiatives (including development of new service offerings and marketing campaigns within the practice), develop materials for and participate in the delivery of presentations to clients and firm personnel, and mentor and develop teams of advisory resources. About the team  Our Accounting Operations Advisory team focuses on enabling CFO's and their Finance teams for success. We focus on applying our deep knowledge of financial reporting requirements, controls and processes to the operational aspects of Finance - \"How\" Finance does what it needs to do and where it can enhance the value it brings to the organization. Our core services include CFO / Finance Effectiveness Workshops, Finance Operating Model Assessments, Finance Process Mapping / Redesign, and \"Fix Finance\" projects (designed to remediate or upgrade finance processes, controls, documentation, systems and tools), and a broad range of Technology Advisory services from assessments, selections, and implementation advisory.   The Digital & Automation practice within our Accounting Operations Advisory team is rapidly expanding. The D&A team is a dynamic group who are focused on helping clients improve their financial services through the use of technology.   A career in Technology will offer you the opportunity to:    Work in a challenging, fast growing, and collaborative team environment with like-minded people who are eminent in their respective technical field   Identify needs and develop technological solutions to complex financial problems through debate and discussion, in teams and with clients   Continue your professional development to reinforce and expand your chosen career path   Assume role as designed in-house BlackLine expert, training colleagues and clients on how best each system can fit their financial needs.    BlackLine and Workiva are software-as-a-service applications which introduce automation to different activities in the Record-to-Report cycle. BlackLine automates different steps in the financial close process including; account reconciliation, task management, matching transactions, system-to-system tie outs, variance analysis, and centralization of journal entry postings. Workiva is a reporting compliance platform that enables the use of connected data and automation of reporting across finance, accounting, risk, and compliance. The candidate would ideally be highly motivated with experience implementing BlackLine; knowledge and experience with other ERP (Enterprise Resource Planning) and CPM (Corporate Performance Management) tools is an asset, along with any experience supporting clients through all phases of the implementation lifecycle. Enough about us, let's talk about you You are someone with:  CPA designation and minimum 10 years of work experience including at system implementation and understanding of the different phases of the software development lifecycle; Experience in a finance role/in providing assurance, consulting & advisory services to finance functions Prior experience using or implementing BlackLine and/or Workiva solutions. Experience in developing business cases, value realization, roadmaps, cost/benefit analyses and communicating to a range of audiences. Strong technical skills & experience with accounting processes, internal controls, risk assessments, IFRS, ASPE, Public Sector Accounting Standards. Expertise in financial management disciplines such as financial process design, budgeting and planning, financial reporting, financial performance management and business case development Additional expertise in one or more of the following areas considered an asset: Process Redesign, Business IT Strategy, Corporate Strategy, or Shared Services Experience in Finance, IT or Audit, considered as a very strong asset; Capacity to think about requirements from a strategic perspective (options available, pros / cons or different options) Strong project management, facilitation and presentation skills Broad advisory skills Proven ability to deliver the full cycle of project management accountabilities (experienced with project problem diagnosis, solution development, client communications, facilitation of decision making, documentation, managing client expectations and team leadership) Operational (ability to translate the \"what is required\" into the \"how it's done\") Problem solving (ability to \"find it\" and \"fix it\" Strong technical skills and experience with accounting processes, internal controls, risk assessments, IFRS, ASPE, Public Sector Accounting Standards Total RewardsThe salary range for this position is $100,000 - $205,000, and individuals may be eligible to participate in our bonus program. Deloitte is fair and competitive when it comes to the salaries of our people. We regularly benchmark across a variety of positions, industries, sectors, targets, and levels. Our approach is grounded on recognizing people's unique strengths and contributions and rewarding the value that they deliver.Our Total Rewards Package extends well beyond traditional compensation and benefit programs and is designed to recognize employee contributions, encourage personal wellness, and support firm growth. Along with a competitive base salary and variable pay opportunities, we offer a wide array of initiatives that differentiate us as a people-first organization. Some representative examples include: $4,000 per year for mental health support benefits, a $1,300 flexible benefit spending account, 38+ days off (including 10 firm-wide closures known as \"Deloitte Days\"), flexible work arrangements and a hybrid work structure.Our promise to our people: Deloitte is where potential comes to life.   Be yourself, and more. We are a group of talented people who want to learn, gain experience, and develop skills. Wherever you are in your career, we want you to advance. You shape how we make impact. Diverse perspectives and life experiences make us better. Whoever you are and wherever you're from, we want you to feel like you belong here. We provide flexible working options to support you and how you can contribute. Be the leader you want to be. Be the leader you want to be  Some guide teams, some change culture, some build essential expertise. We offer opportunities and experiences that support your continuing growth as a leader. Have as many careers as you want. We are uniquely able to offer you new challenges and roles - and prepare you for them. We bring together people with unique experiences and talents, and we are the place to develop a lasting network of friends, peers, and mentors. Our TVP is about relationships - between leaders and their people, the firm and its people, peers, and within in our communities.The next step is yours   At Deloitte, we are all about doing business inclusively - that starts with having diverse colleagues of all abilities. Deloitte encourages applications from all qualified candidates who represent the full diversity of communities across Canada. This includes, but is not limited to, people with disabilities, candidates from Indigenous communities, and candidates from the Black community in support of living our values, creating a culture of Diversity Equity and Inclusion and our commitment to our AccessAbility Action Plan , Reconciliation Action Plan and the BlackNorth Initiative .  We encourage you to connect with us at accessiblecareers@deloitte.ca if you require an accommodation for the recruitment process (including alternate formats of materials, accessible meeting rooms or other accommodations) or indigenouscareers@deloitte.ca for any questions relating to careers for Indigenous peoples at Deloitte (First Nations, Inuit, Métis). By applying to this job you will be assessed against the Deloitte Global Talent Standards. We've designed these standards to provide our clients with a consistent and exceptional Deloitte experience globally. Deloitte Canada has 30 offices with representation across most of the country. We acknowledge our offices reside on traditional, treaty and unceded territories as part of Turtle Island and is still home to many First Nations, Métis, and Inuit peoples. We are all Treaty people.Job Segment:  ERP, Marketing Manager, Developer, Project Manager, Accounting, Technology, Marketing, Finance\n\n                    Category\n Management and Executive\n", "details": ["\n\n                                4 days ago\n                            ", " Full Time", " Management and Executive"]}, {"title": "Senior Geochemist", "company": "WSP Canada", "date": "Mar. 24, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\nOutstanding career opportunities - we're growing and pushing ourselves every day to be greater than yesterday - we're open to your ideas and trying new things. WSP has a new opportunity for an Intermediate Geochemist to join our Mine Water & Environment team on a full-time basis based in Vancouver/Calgary/Edmonton/Western Canada.The selected candidate will support and lead geochemistry-related projects and proposal efforts with an emphasis on the mining and construction industries in Canada and globally. Projects typically involve material characterization, permitting, baseline studies, operational support, and reclamation/remediation. We offer attractive pay, flexible work options, a great corporate culture, comprehensive and employee-focused benefits including virtual healthcare and a wellness platform as well as great savings programs, and a clear vision for the future. #WeAre WSP  #globalmining  A day in the life...  Bringing your talents, training, enthusiasm, and solution-oriented focus to work as a valued and respected member of our multi-disciplinary team of professionals as we tackle some of the world's most challenging environmental problems and deliver some of the world's most innovative and relevant solutions; From day one you'll be contributing to the business and technical mission of a multi-disciplinary team environment within Mine Environment and related technical discipline groups; Alongside the technical lead(s), you will be responsible for the day to day running of projects to ensure that deliverables are provided to our diverse clients on time and on budget;  You will be responsible for summarizing and interpreting datasets, statistical analysis, and preparing written and graphical material for incorporating into reports and presentations; You will supervise early career staff to ensure the implementation of quality assurance/quality control measures applicable to the task; Conducting geochemical characterization studies of mine wastes (ore, waste rock, gases, and water), radiological assessments, and other environmental investigations with support from early career professionals; Coordinating and liaising with laboratories on geochemical and mineralogical analyses; Planning and coordination field visits with project management and client teams; Oversee the delivery of reports to clients from concept to review and submission; Responsibility for conceptual model development and supporting data management and interpretation;  Demonstrating a \"Safety-First\" focus and always ensure health and safety policies are followed at all sites where you undertake project work.  What you'll bring to WSP...  A degree in Geochemistry, Geoscience or Geology, Geological Engineering, Hydrogeology, Hydrology or related fields; 3 to 10 years work experience in geochemical assessments within natural or mine-affected sites; Eligibility for professional registration as a Registered Professional Geologist or other applicable professional regulatory body; Project management experience and experience reporting on material characterization, mine permitting and/or water quality modelling; Familiarity with PowerBi, python, R or similar coding and data presentation software is desirable; Familiarity with industry-standard modelling software such as PHREEQC, Geochemist 's Workbench, and GoldSim would be considered an asset; Understanding of environmental chemistry, geology, and mineralogy to support material characterization studies relating to mine operations; Interest in critical minerals or environmental policy; Excellent organizational and communications skills; Strong quantitative skills; Strong written and verbal communication skills; Passion for working in a dynamic, multi-disciplinary team environment; Strong interpersonal, communication and innovative thinking skills are essential; A positive demeanor towards carrying out your work safely and supporting the safe work of those you work with. Compensation  Expected Salary (all locations): $84,200 - $143,100 WSP Canada is providing the compensation range that the company in good faith believes it will pay for this position based on the successful applicant's education, experience, knowledge, skills, abilities in addition to the specific geographic location. WSP  is one of the world's leading professional services firms. Our purpose is to future proof our cities and environments. We have over 65,000 team members across the globe. In Canada, our 12,000+ people are involved in everything from environmental remediation to urban planning, from engineering iconic buildings to designing sustainable transportation networks, from finding new ways to extract essential resources to developing renewable power sources for the future. At WSP: We value our people and our reputation We are locally dedicated with international scale We are future focused and challenge the status quo We foster collaboration in everything we do We have an empowering culture and hold ourselves accountable Please Note:Health and Safety is a core paramount value of WSP. Given the importance of keeping one another safe it is expected that you comply with our Health, Safety & Environment (HSE) policy at all times as well as client HSE policies when working at client locations. Offers of employment for safety-sensitive positions involving fieldwork are contingent upon candidates being able to perform key physical tasks of the job as described in the job posting and interview. This may include the ability to work in a variety of environmental conditions, such as remote or isolated areas, working alone, and in inclement weather (within safe and reasonable limits).  WSP welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process.  WSP is committed to the principles of employment equity. Only the candidates selected will be contacted. WSP does not accept unsolicited resumes from agencies. For more information please READ THE FULL POLICY. \nCategory\n Science\n", "details": ["\n\n                                6 days ago\n                            ", " Full Time", " Science"]}, {"title": "ServiceNow (GRC/IRM) Senior Developer, Deloitte Global Technology", "company": "Deloitte", "date": "Mar. 24, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\nWhat will your typical day look like? In this role, you will: •Create, configure, and customize ServiceNow applications for new and existing implementations. •Create and configure functional data such as Notifications and Service Level Agreements. •Create and configure script objects such as Business Rules, Script Includes, UI Policies and Actions, Client Scripts, ACLs. •Set-up interfaces between ServiceNow and other platforms in line with integration opportunities identified by Solution Architects. •Perform system and integration testing. •Recommend Administration settings and best practices. •Create documentation of the developments, unit test cases and implementation plans. •Work effectively in diverse teams within an inclusive team culture where people are recognized for their contribution.About the team   Deloitte Technology works at the forefront of technology development and processes to support and protect Deloitte around the world. In this truly global environment, we operate not in \"what is\" but rather \"what can be\" to help Deloitte deliver and connect with its clients, its communities, and one another in ways not previously conceived. Enough about us, let's talk about you Required •At least 5-6 years of ServiceNow experience, including custom development, configuration. •At least 2-3 years of ServiceNow GRC/IRC experience. •ServiceNow scripting experience using JavaScript, HTML, CSS, XML and REST/SOAP Web Services. •Understanding and experience of Business Rules, Script Includes, UI Actions and all scripted aspects of ServiceNow. •Customize ServiceNow UI and Service Portal through use of UI pages, CMS, CSS and Service Portal widgets. •Working knowledge of integrations and migrations. •Deep understanding of ITIL. •Working understanding of ServiceNow administration settings and deep functional and technical knowledge of the ServiceNow platform as well as experience delivering medium to large-scale ServiceNow implementations. •Comfort working in an agile environment with constant feedback and interaction with the team and ability to work under high pressure. •Demonstrated ability to troubleshoot technical issues. Preferred •Experience working with geographically distributed and culturally diverse work groups. •Advanced written and verbal communication skills with the ability to present to IT and business leaders. •Demonstrated ability to stay current with development best practices, existing and emerging technology platforms, and industry trends. •Experience with formal software development methodologies, with a focus on Agile. •ServiceNow Certified Systems Administrator is a must. •ServiceNow Implementation Specialist & CAD is a great bonus.Total RewardsThe salary range for this position is $58,000 - $96,000, and individuals may be eligible to participate in our bonus program. Deloitte is fair and competitive when it comes to the salaries of our people. We regularly benchmark across a variety of positions, industries, sectors, targets, and levels. Our approach is grounded on recognizing people's unique strengths and contributions and rewarding the value that they deliver.Our Total Rewards Package extends well beyond traditional compensation and benefit programs and is designed to recognize employee contributions, encourage personal wellness, and support firm growth. Along with a competitive base salary and variable pay opportunities, we offer a wide array of initiatives that differentiate us as a people-first organization. Some representative examples include: $4,000 per year for mental health support benefits, a $1,300 flexible benefit spending account, 38+ days off (including 10 firm-wide closures known as \"Deloitte Days\"), flexible work arrangements and a hybrid work structure.Job Segment:  Testing, CAD, Drafting, Developer, XML, Technology, Engineering\n\n                    Category\n Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Full Time", " Information Technology"]}, {"title": "ER&I Senior Channel Sales Manager, SAP", "company": "Deloitte", "date": "Mar. 27, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\nJob Type:Permanent Work Model:Hybrid Reference code:126095 Primary Location:Calgary, AB All Available Locations:Calgary, AB; Halifax, NS; Montreal, QC; Ottawa, ON; Toronto, ON; Vancouver, BC  Our Purpose   At Deloitte, we are driven to inspire and help our people, organization, communities, and country to thrive. Our Purpose is to build a better future by accelerating and expanding access to knowledge. Purpose defines who we are and gives us reason to exist as an organization.  By living our Purpose, we will make an impact that matters.  Learn from deep subject matter experts through mentoring and on the job coaching Be encouraged to deepen your technical skills...whatever those may be. Have many careers in one Firm. What will your typical day look like? Deloitte Canada is seeking an experienced sales professional to support our successful and growing SAP implementation practice. The individual will focus on our market position, relationship with SAP on various levels and capacities, and most importantly lead sales activities specific to Western Canadian Market in the ER&I (Energy, Resources & Industrials) space. The primary role of the position will be to develop relationships with SAP, our leadership and client service partners, Senior Executives in target companies to identify opportunities that will generate top-line revenue.About the team  You will participate and coordinate the development of sales strategies related to SAP services and solutions while driving key sales campaigns/initiatives with a national scope. You will be responsible to:     Plan and execute calls and cadences to manage various relationships,     Manage and/or coach team members and SAP-focused practice leads through the various steps of the firm's sales cycle in collaboration with Deloitte,     Ensure the growth and maintenance of the pipeline with regular CRM hygiene.     Participate in innovating the sales process and continuous improvement in our sales operations.     Drive resell sales & proactive collaboration with SAP      Part of your daily routine will be to develop strong working relationships with Partners related to assigned targets, ER&I Industry Leaders, SAP stakeholders and clients. You will also need to maintain the relationship with other Deloitte marketing sales and pursuit support practitioners. Additionally, you will actively participate in the continuous improvement of our sales operations including, go-to market initiatives, innovating our offering and our overall sales strategy. Enough about us, let's talk about you   Are you someone with:      Minimum 10+ years of sales experience, with at least 5 years selling professional services in technology (software and SAP-specific sales experience is an asset),     Demonstrated ability to train and mentor others in professional sales,     A good understanding of business, business pain points, and an ability to converse with business leaders,     Ability to maintain and foster senior relationships with SAP ,     Strong expertise in software sales, channel sales strategy, and selling motions,     Experience improving and innovating sales processes,     Capacity to navigate across Alliance Partner Sales, Service and Support organization and connect the vendor partner(s) with the Deloitte Teams      Due to the nature of the role having interactions with National & Global clients,bilingualismin French and English is required for this position . Total RewardsThe salary range for this position is $104,000 - $215,000, and individuals may be eligible to participate in our bonus program. Deloitte is fair and competitive when it comes to the salaries of our people. We regularly benchmark across a variety of positions, industries, sectors, targets, and levels. Our approach is grounded on recognizing people's unique strengths and contributions and rewarding the value that they deliver.Our Total Rewards Package extends well beyond traditional compensation and benefit programs and is designed to recognize employee contributions, encourage personal wellness, and support firm growth. Along with a competitive base salary and variable pay opportunities, we offer a wide array of initiatives that differentiate us as a people-first organization. Some representative examples include: $4,000 per year for mental health support benefits, a $1,300 flexible benefit spending account, 38+ days off (including 10 firm-wide closures known as \"Deloitte Days\"), flexible work arrangements and a hybrid work structure.Our promise to our people: Deloitte is where potential comes to life.   Be yourself, and more. We are a group of talented people who want to learn, gain experience, and develop skills. Wherever you are in your career, we want you to advance. You shape how we make impact. Diverse perspectives and life experiences make us better. Whoever you are and wherever you're from, we want you to feel like you belong here. We provide flexible working options to support you and how you can contribute. Be the leader you want to be. Be the leader you want to be  Some guide teams, some change culture, some build essential expertise. We offer opportunities and experiences that support your continuing growth as a leader. Have as many careers as you want. We are uniquely able to offer you new challenges and roles - and prepare you for them. We bring together people with unique experiences and talents, and we are the place to develop a lasting network of friends, peers, and mentors. Our TVP is about relationships - between leaders and their people, the firm and its people, peers, and within in our communities.The next step is yours   At Deloitte, we are all about doing business inclusively - that starts with having diverse colleagues of all abilities. Deloitte encourages applications from all qualified candidates who represent the full diversity of communities across Canada. This includes, but is not limited to, people with disabilities, candidates from Indigenous communities, and candidates from the Black community in support of living our values, creating a culture of Diversity Equity and Inclusion and our commitment to our AccessAbility Action Plan , Reconciliation Action Plan and the BlackNorth Initiative .  We encourage you to connect with us at accessiblecareers@deloitte.ca if you require an accommodation for the recruitment process (including alternate formats of materials, accessible meeting rooms or other accommodations) or indigenouscareers@deloitte.ca for any questions relating to careers for Indigenous peoples at Deloitte (First Nations, Inuit, Métis). By applying to this job you will be assessed against the Deloitte Global Talent Standards. We've designed these standards to provide our clients with a consistent and exceptional Deloitte experience globally. Deloitte Canada has 30 offices with representation across most of the country. We acknowledge our offices reside on traditional, treaty and unceded territories as part of Turtle Island and is still home to many First Nations, Métis, and Inuit peoples. We are all Treaty people.Job Segment:  SAP, Marketing Manager, ERP, Developer, Equity, Technology, Marketing, Finance\n\n                    Category\n Management and Executive\n", "details": ["\n\n                                4 days ago\n                            ", " Full Time", " Management and Executive"]}, {"title": "IT Operations Coordinator - Remote", "company": "Hunt Personnel/Temporarily Yours", "date": "Mar. 27, 2024", "location": "<br/>\nRichmond, BC<br/>\nRemote, <br/>\n</div>", "descrip": "\nDo you have IT coordination experience and are looking to take on short-term work from the comfort of your home? Step into this fully remote 1-2 month temporary assignment with a leading engineering and software development firm. Reporting to the IT Manager, this role will provide support across a wide variety of tech projects and operational functions.\n*Candidates must be based in the BC lower mainland to be considered.*\nWhat’s In It For You\nThis opportunity offers hourly pay in the $25-29 range, depending on the skills and experience you bring to the role. You’ll also receive 4% pay in lieu of vacation.\nWhat You’ll Do\n\nAssist with organizing meetings and presentations, take meeting minutes\nPrepare various reports including project updates and operational summary updates\nFile and manage confidential documents\nCreate, track and file Purchase Orders\nReview vendor contracts ensuring they comply with company policies\nUpdate and manage asset purchase lists\nPrepare training documents and coordinate training schedules\nAssist the Operations Managers with various other administrative tasks\n\nWhat You Bring \n\nMinimum 2 years of experience coordinating and supporting IT operations\nA diploma in Computer Science or a college degree with a technical major\nStrong computer proficiency and the ability to learn new software and systems with ease  \nExperience with programs such as Ivanti, CRM, Outlook, Word, Excel and PowerPoint\nExperience using MS Teams is an asset\n\nCategory\n Administrative Information Technology\n", "details": ["\n\n                                3 days ago\n                            ", "\n\n                                    25 to 29 per year\n                                ", " Richmond, BC", " Temp", " Administrative", " Information Technology"]}, {"title": "Coordinator, Projects Implementation (nw)", "company": "Northern Health", "date": "Mar. 24, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\nPosition SummaryIf you are looking for friendly, supportive staff, and work life balance this may be just the opportunity that will take your career to a new level.The Coordinator, Projects Implementation is responsible for problem solving and leading the coordination and completion of initiatives related to project work assignments within the HSDA. Under the direction of the Project Implementation Lead, the incumbent will work with regional programs and local teams to proactively identify problems and implement initiatives. The incumbent provides expertise, education, facilitation and coaching to team members assigned to various strategic and critical priority related initiatives. The Coordinator leads others toward the achievement of project goals through effectively communicating the project vision, coordinating resources, advancing priorities, and promoting collaboration and the commitment of key stakeholders. The Coordinator supports project work groups and committees and is the key point person for achieving integration of project findings/recommendations. The Coordinator will raise related operational issues to the attention of the Project Implementation Lead and associated operational Lead in adherence with guidelines provided. The Coordinator works with the Project Implementation Lead to analyze interdependencies and timing of initiatives across the HSDA. The Coordinator assists with planning, implementation, monitoring of outcomes and will work closely with and provide reports to the Chief Operating Officer (COO), Senior Leadership Team (SLT), and operational teams.Starting salary will be approximately from $72,445 to $90,556 and will be based on education, training, experience, and salaries of similar positions. This position is flexible to the Northwest Northern Health region. Explore these communities northern communities. What Northern Health has to offer you!• Comprehensive benefit packages including extended health/dental and a municipal pension plan for part-time and full-time employees. Casuals have the option of paying for benefits. • Four weeks vacation with one year of continuous service• Financial Support for Moving Expenses is available for eligible positions• Employee referral program• Employer-paid training and leadership development opportunities• Spectacular outdoor activities and the shortest commutes in BC• \"Loan Forgiveness Programs\" are offered through the Federal and BC Government for eligible professions.IMPORTANT NOTE:As part of your application process, you will need to upload the following documentation:•  Proof of COVID-19 vaccination•  Registration number (if you are part of a regulated profession)•  Any supporting documents regarding education/qualifications for this position. Examples may include:•  Program certificates or diplomas•  High school/college/university transcripts etc.•  It is also recommended to provide a cover letter and resumeQualfications• Baccalaureate Degree in Business, Commerce, Health Administration, or relevant health care discipline.• Five (5) to seven (7) years recent, related experience in project management, preferably in a healthcare setting.• Or an equivalent combination of education, training, and experience.Skills and Abilities: • Broad knowledge of project design, methodologies, and developing and managing project strategies.• Advanced level knowledge in project management or quality improvement methodologies.• Demonstrated analytical problem solving to develop progressive, creative and innovative solutions.• Excellent oral and written communication skills to present and prepare concise analyses, reports and recommendations and to consult with individuals at all levels of the organization.• Ability to build relationships across all levels, including the ability to overcome resistance, develop buy in, coach, mentor and educate.• Knowledge of quality improvement principles, theory, and practice.• Ability to foster innovation within a complex multi-stakeholder organization.• Demonstrated ability to focus on and achieve results.• Ability to work effectively, both independently and as part of a team.• Ability to lead change and manage conflict within a fast-paced and often ambiguous environment• Ability to balance multiple activities concurrently through strong organizational skills and communication• Ability to operate related equipment including computer software applications.Who we areNorthern Health covers an area of nearly 600,000 square kilometers and offers health services in over two dozen communities and 55 First Nation's communities. We deliver hospital and community-based health care for a population of 300,000.Employing more than 7,000 staff throughout the region, Northern Health provides exceptional health services for Northerners, through the efforts of dedicated staff and physicians, in partnership with communities and organizations in Northern BC.There is a wide variety of career opportunities available in our two dozen hospitals, 25 long-term care facilities, public health units and many other offices providing specialized services.\n\n                    Category\n Administrative\n", "details": ["\n\n                                6 days ago\n                            ", " Full Time", " Administrative"]}, {"title": "Senior Developer", "company": "Great Canadian Gaming Corp.", "date": "Mar. 28, 2024", "location": "<br/>\nVictoria, BC<br/>\n</div>", "descrip": "\n Senior Software Developer    •  Employment Type : permanent full-time role  •  Location: Remote within Canada   About the Job   We are looking for someone with a high bar for technical excellence, scalable architecture, and security. As business is growing, and we're looking for passionate developers to deliver product features, improve our development processes and help achieve our business goals. We ship code every day and we're proud of our deployment and agile process.   Please note the preferred location for this role is British Columbia, but we are open to hiring remotely within Canada. Some tasks you'll be taking on •  Developing high-quality software components that integrate with new or existing systems, ensuring compliance with established architectural standards.  •  Designing and implementing scalable, robust, and maintainable software.  •  Identify areas of improvement in existing systems, proposing and implementing solutions to enhance performance, maintainability, and scalability.  •  Championing the adoption of software design patterns, code quality tools, and best practices within the development team.  •  Collaborating with project managers, product owners, and other stakeholders to refine software development processes, ensuring agile, efficient, and effective workflows.  •  Writing clear documentation on our systems, architecture, and processes, ensuring they are accessible and understood by all relevant parties.  •  Teaching and mentoring your colleagues through pair programming and code review. Ideally, you should have •  8+ years of software development experience  •  A passion for writing simple, maintainable software  •  Excellent communication, collaboration, and problem-solving skills  •  Familiarity with modern software architectures and cloud platforms  •  Experience with CI/CD tools and practices  •  Experience in an agile work environment  •  Knowledge of software development patterns and best practices  •  Experience mentoring other developers Bonus Points for •  Experience with online bookings, and the tourism & activity industry  •  Experience with some of our tech stack: PHP, Node.js, TypeScript, React, PostgreSQL, Docker, Google Cloud   If you don't meet all of our requirements exactly or have some gaps in your resume know that we would still love to hear from you! Use your cover letter to tell us about your unique experience - we understand that talent comes from many places and that skills are transferable. You get •  A company that values work-life balance  •  A constructive environment with room to learn, excel and impact  •  Vacation, personal days, health days, paid volunteer day, and bonus days  •  Extended health benefits and EAP program  •  Parental benefits  •  Professional development allowance  •  Mentorship program  •  Team building events  •  Hackathons  •  A newly renovated (as of May 2020) \"tourism themed\" office space in downtown Victoria  •  Travel budget to visit the office throughout the year, if remote   If interested, please send your resume to Rimjhim.sinha@brainhunter.com\nCategory\n Information Technology\n", "details": ["\n\n                                3 days ago\n                            ", " Victoria, BC", " Full Time", " Information Technology"]}, {"title": "Release Train Engineer, Deloitte Global Technology", "company": "Deloitte", "date": "Mar. 27, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\nJob Type:Permanent Reference code:126070 Primary Location:Toronto, ON All Available Locations:Toronto, ON  Our Purpose   At Deloitte, we are driven to inspire and help our people, organization, communities, and country to thrive. Our Purpose is to build a better future by accelerating and expanding access to knowledge. Purpose defines who we are and gives us reason to exist as an organization. By living our Purpose, we will make an impact that matters.  Learn from deep subject matter experts through mentoring and on the job coaching. Be encouraged to deepen your technical skills...whatever those may be. Have many careers in one Firm. What will your typical day look like?As the Release Train Engineer, you will be tasked with guiding the agile team in providing effective solutions and leading them to stay on track. Other duties include the following. Responsibilities:  Facilitate and manage the Agile Release Train (ART) processes and execution. Lead the coordination of resources, prioritization of tasks, and the resolution of conflicts to meet project deadlines. Assist with program and project level risk management and process improvements. Coordinate and facilitate program increment planning events. Foster a collaborative and transparent environment that helps teams to align around common goals. Work closely with Product Managers and other stakeholders to ensure strategy and execution alignment. Coach teams in Agile methodologies and mindsets. About the teamGlobal Technology Services works at the forefront of technology development and processes to support and protect Deloitte around the world. In this truly global environment, we operate not in \"what is\" but rather \"what can be\" to help Deloitte deliver and connect with its clients, its communities, and one another in ways not previously conceived.Enough about us, let's talk about youRequired:   Bachelor's degree in Computer Science, Information Systems, Business Administration, or a related field. Minimum 5 years of experience in a software development environment, with at least 2 years in a RTE or Scrum Master role. Knowledge of Agile practices and principles, including Scrum and Kanban.   Preferred:   Certified SAFe Release Train Engineer or equivalent certification is highly desired.  Total RewardsThe salary range for this position is $85,000 - $156,000, and individuals may be eligible to participate in our bonus program. Deloitte is fair and competitive when it comes to the salaries of our people. We regularly benchmark across a variety of positions, industries, sectors, targets, and levels. Our approach is grounded on recognizing people's unique strengths and contributions and rewarding the value that they deliver.Our Total Rewards Package extends well beyond traditional compensation and benefit programs and is designed to recognize employee contributions, encourage personal wellness, and support firm growth. Along with a competitive base salary and variable pay opportunities, we offer a wide array of initiatives that differentiate us as a people-first organization. Some representative examples include: $4,000 per year for mental health support benefits, a $1,300 flexible benefit spending account, 38+ days off (including 10 firm-wide closures known as \"Deloitte Days\"), flexible work arrangements and a hybrid work structure.Our promise to our people: Deloitte is where potential comes to life.   Be yourself, and more. We are a group of talented people who want to learn, gain experience, and develop skills. Wherever you are in your career, we want you to advance. You shape how we make impact. Diverse perspectives and life experiences make us better. Whoever you are and wherever you're from, we want you to feel like you belong here. We provide flexible working options to support you and how you can contribute. Be the leader you want to be. Be the leader you want to be  Some guide teams, some change culture, some build essential expertise. We offer opportunities and experiences that support your continuing growth as a leader. Have as many careers as you want. We are uniquely able to offer you new challenges and roles - and prepare you for them. We bring together people with unique experiences and talents, and we are the place to develop a lasting network of friends, peers, and mentors. Our TVP is about relationships - between leaders and their people, the firm and its people, peers, and within in our communities.The next step is yours   At Deloitte, we are all about doing business inclusively - that starts with having diverse colleagues of all abilities. Deloitte encourages applications from all qualified candidates who represent the full diversity of communities across Canada. This includes, but is not limited to, people with disabilities, candidates from Indigenous communities, and candidates from the Black community in support of living our values, creating a culture of Diversity Equity and Inclusion and our commitment to our AccessAbility Action Plan , Reconciliation Action Plan and the BlackNorth Initiative .  We encourage you to connect with us at accessiblecareers@deloitte.ca if you require an accommodation for the recruitment process (including alternate formats of materials, accessible meeting rooms or other accommodations) or indigenouscareers@deloitte.ca for any questions relating to careers for Indigenous peoples at Deloitte (First Nations, Inuit, Métis). By applying to this job you will be assessed against the Deloitte Global Talent Standards. We've designed these standards to provide our clients with a consistent and exceptional Deloitte experience globally. Deloitte Canada has 30 offices with representation across most of the country. We acknowledge our offices reside on traditional, treaty and unceded territories as part of Turtle Island and is still home to many First Nations, Métis, and Inuit peoples. We are all Treaty people.Job Segment:  Developer, Computer Science, Equity, Risk Management, Information Systems, Technology, Finance\n\n                    Category\n Information Technology\n", "details": ["\n\n                                3 days ago\n                            ", " Full Time", " Information Technology"]}, {"title": "Embedded Software Developer", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionAs a fast growing successful organization, Fortinet Technologies is looking for an upbeat C Guru to join our team. We are looking for a junior to intermediate level developer. This position offers variety and direct involvement with complex, innovative technology; as well as the opportunity to work with a close knit team of experienced and talented developers.   As an Embedded Software Developer at Fortinet, you will be responsible for the full development cycle of newer and award winning flagship Fortinet products. You will be given the opportunity to participate in the development cycle from troubleshooting and testing to participation in the design and development of new features. You will work with the latest technologies for our next generation high performance distributed security systems. Join our team of enthusiastic developers and become a leader in network security.   More senior? If you enjoy being involved in entire development lifecycle of complex software, naturally take ownership in projects, comfortably interact with cross-functional departments, and enjoy mentoring emerging developers, you will find Fortinet has a platform to support your professional success.    Job Responsibilities:     • Development, design and test the software for Fortinet products   • Hands on in bug fixing   • Maintain and document code using source control system   • Maintenance, performance tuning, and support of implemented software or firmware products   • Implement new features according to identified specs     Job Skills Required:     • C/C++ experience   • Experience with TCP/IP, Firewall, UTM   • Software development experience in Unix/Linux environment   • Capable of switching focus in various situations and apply themselves to quickly learning new technologies and adopting new methodologies   • Excellent problem solving and troubleshooting skills   • Relational database skills is an asset     Educational Requirements:     • Bachelor's Degree (Masters or PhD is an asset) in Computer Science or similar degree    #GD  #LI-MG1\n\n                    Category\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "Principal Rock Mechanics Engineer", "company": "WSP Canada", "date": "Mar. 24, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\n                    Join our team of intelligent and collaborative Changemakers and make your mark on tomorrow! This role will see you become a leader, thereby enhancing your capabilities and the reputation of WSP's Mine Engineering & Stability team. You will collaborate with talented and diverse professionals while leading and managing the delivery of open pit and underground mine geotechnical services projects.Our Mining team helps clients optimise performance, boost profitability, and operate responsibly. We have a comprehensive understanding of the mining industry and current issues including decarbonisation and understand future ready strategies are critical to countering these issues, capitalising on opportunities, and adding value to businesses.#GlobalminingWhat you will do Leading and managing delivery of open pit and underground mine geotechnical services projects; Overseeing all aspects of the project lifecycle (proposal, contract, scope of work, technical quality and senior review) and consulting with appropriate peers; Delivering technically appropriate and cost-effective solutions to clients which meet time, budget, quality and safety requirements; Statistical analyses and interpretation of drill and laboratory data to characterise material properties for use in geotechnical design; Identification and management of geotechnical hazards; Stability analyses and material characterization; Review and assess designs in 3D modelling packages, ideally Vulcan or Leapfrog experience preferred; Liaise with a rangeofkey internal and external stakeholders on geological and geotechnical aspects of projects; and Actively mentoring and coaching of junior staff across the business in the interests of their long-term career objectivesWhat we will love about you Bachelor degree or similar in engineering or science and a postgraduate qualification in rock mechanics or geotechnical engineering Registered Professional Engineer in Canada or ability to apply Extensive industry relevant experience Fantastic analytical and problem-solving skills Excellent project management skills and the ability to build relationships with client Experience with Rocscience software suite; and Demonstrable experience in development of geotechnical models. WSP  is one of the world's leading professional services firms. Our purpose is to future proof our cities and environments. We have over 65,000 team members across the globe. In Canada, our 12,000+ people are involved in everything from environmental remediation to urban planning, from engineering iconic buildings to designing sustainable transportation networks, from finding new ways to extract essential resources to developing renewable power sources for the future. At WSP: We value our people and our reputation We are locally dedicated with international scale We are future focused and challenge the status quo We foster collaboration in everything we do We have an empowering culture and hold ourselves accountable Please Note:Health and Safety is a core paramount value of WSP. Given the importance of keeping one another safe it is expected that you comply with our Health, Safety & Environment (HSE) policy at all times as well as client HSE policies when working at client locations. Offers of employment for safety-sensitive positions involving fieldwork are contingent upon candidates being able to perform key physical tasks of the job as described in the job posting and interview. This may include the ability to work in a variety of environmental conditions, such as remote or isolated areas, working alone, and in inclement weather (within safe and reasonable limits).  WSP welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process.  WSP is committed to the principles of employment equity. Only the candidates selected will be contacted. WSP does not accept unsolicited resumes from agencies. For more information please READ THE FULL POLICY. \nCategory\n Engineering\n", "details": ["\n\n                                6 days ago\n                            ", " Full Time", " Engineering"]}, {"title": "Mobile Development Manager", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionFortinet has an exciting opportunity for an experienced software developer to lead our FortiExplorer mobile development team! FortiExplorer is our mobile firewall management software which allows users to unlock the functionality of Fortinet solutions from a mobile device! This video - https://youtu.be/KRE3YIOmX_A - outlines FortiExplorers functionality and you can download the latest versions from the app store to try it out yourself!   Fortinet is looking for candidates with a strong mobile development background and a passion for creating user-friendly, powerful interfaces. You will manage a small team of mobile development professionals responsible for developing the next generation versions of FortiExplorer and will also lead by example in designing and developing this software.   Job Responsibilities:    • Lead and mentor a team of mobile developers responsible for developing our Android , iOS and tvOS FortiExplorer applications.   • Design and develop software for Fortinet mobile applications   • Troubleshoot, identify and improve product quality following QA testing and customer feedback   • Maintain, improve and support existing software products   • Collaborate with other teams to integrate product functionality    Job Skills Required:    • Extensive experience in mobile development (Android and/or iOS)   • Proven track record of designing and building mobile applications   • Experienced leading a teams of software developers   • Experience training and mentoring software developers in previous positions   • Hands-on experience with one or more of the following - Java, Kotlin, Swift, Objective-C, Flutter   • Experience with Git and continuous integration is a plus   • Knowledgeable when it comes to TCP/IP networking and network security   • Experience with Unit testing/TDD    Educational Requirements:    • Diploma in Computer Science or related field    #GD   #LI-CN1\n\n                    Category\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "Hydrotechnical / Water Resources / Hydrology Engineers", "company": "WSP Canada", "date": "Mar. 24, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\n                    WSP is currently seeking Hydrotechnical Engineers to join our growing Transportation and Infrastructure group in British Columbia, Canada. We are looking for engineers who can bring their skills and experience to lead our hydrotechnical projects, work closely with our staff and clients, and deliver high-quality projects from start to finish. You will have the opportunity to work on road and highway infrastructure projects that involve bridges, culverts, river training, erosion protection works, and other surface water components. You will also have the chance to contribute to multidisciplinary projects with a range of complexity for Federal, Provincial, and Municipal clients within Canada, with a focus on BC and the Yukon. The location for this role is flexible within British Columbia (e.g. Victoria, Nanaimo, Vancouver, Kelowna, Kamloops, Prince George, Smithers, Fort St. John, etc). Candidates currently residing anywhere in Canada, who are open to relocate to British Columbia, are encouraged to apply.  A day in the life:   You are expected to be involved with, or leading, or managing, multi-disciplinary projects from beginning to end including the proposal, planning, options assessment, design, and construction phases.   Technical skills in the development of hydrotechnical engineering design solutions for a variety of interesting projects related to bridges and culverts, hydrology, climate change, river engineering, flood and erosion management, dike design and repair, debris flood/flow management, channel improvements, habitat enhancements, hydraulic structures, hydraulic modeling (1D and 2D), and highway drainage.   Participate in the success and growth of the team by providing mentoring to junior staff, and by helping to develop technical tools and resources.   Preparation and review of deliverables including drawings, cost estimates, technical specifications, construction documents, and field reviews.   Project management planning and implementation including scope, schedule, budget, and quality control.   Coordination within multidisciplinary teams and providing guidance to other staff.   Working with clients directly or in a supporting role, developing and sustaining positive business relationships.   Ability to travel occasionally is desirable for design and construction field services.  What you'll bring to WSP ...   Bachelor's degree in Structural or Civil Engineering.   Registration or eligibility for registration as a Professional Engineer (P.Eng.) with EGBC is a requirement.   Minimum 6-12 years of related consulting experience working in an engineering role.   Current knowledge of Provincial and Federal standards and guidelines related to hydrotechnical components of transportation projects.   Experience with BC Ministry of Transportation and Infrastructure and Federal Government processes, standards, and guidelines is an asset.   Advanced understanding and commitment to technical excellence related to hydrologic and hydraulic modeling, analysis and design.   Experience with general civil engineering design and construction. Specific experience with bridge and highway design is an asset.   Computer skills and experience with hydrotechnical software such as: Hyfran, HEC-RAS 1D and 2D, HY‑8, ArcGIS, Global Mapper, and Civil 3D.   Critical thinking skills for problem-solving and finding efficient, innovative, and practical solutions to engineering challenges.   Strong ability to communicate effectively with internal and external clients and stakeholders.   A team player attitude and the ability to motivate and lead by example.   Self-motivated with ability to work in a team as well as independently on multiple projects.   Possession of a valid Class 5 Driver's License an asset.  Compensation Expected Salary (all locations): $84,200 - $143,100WSPCanadais providing the compensation range that the company in good faith believes it will pay for this position based on the successful applicant's education, experience, knowledge, skills, abilities in addition to the specific geographic location. WSP  is one of the world's leading professional services firms. Our purpose is to future proof our cities and environments. We have over 65,000 team members across the globe. In Canada, our 12,000+ people are involved in everything from environmental remediation to urban planning, from engineering iconic buildings to designing sustainable transportation networks, from finding new ways to extract essential resources to developing renewable power sources for the future. At WSP: We value our people and our reputation We are locally dedicated with international scale We are future focused and challenge the status quo We foster collaboration in everything we do We have an empowering culture and hold ourselves accountable Please Note:Health and Safety is a core paramount value of WSP. Given the importance of keeping one another safe it is expected that you comply with our Health, Safety & Environment (HSE) policy at all times as well as client HSE policies when working at client locations. Offers of employment for safety-sensitive positions involving fieldwork are contingent upon candidates being able to perform key physical tasks of the job as described in the job posting and interview. This may include the ability to work in a variety of environmental conditions, such as remote or isolated areas, working alone, and in inclement weather (within safe and reasonable limits).  WSP welcomes and encourages applications from people with disabilities. Accommodations are available on request for candidates taking part in all aspects of the selection process.  WSP is committed to the principles of employment equity. Only the candidates selected will be contacted. WSP does not accept unsolicited resumes from agencies. For more information please READ THE FULL POLICY. \nCategory\n Engineering\n", "details": ["\n\n                                6 days ago\n                            ", " Full Time", " Engineering"]}, {"title": "Embedded Software Developer", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionFortinet is looking for C Developers with a passion to improve and expand the rich feature set of our FortiGate firewall. You will join a dedicated team that is creating a compelling and innovative Unified Threat Management feature set (Anti-Virus, Web Filter, Data Leak Prevention and Anti-Spam). You love tackling challenging problems and take pride in writing clean, well thought-out code. You use and create tools that improve development processes, allowing you to focus on development. Most of all, you are driven to learn and grow -- making your work rewarding and FortiGate the best it can be for our users.  Job Responsibilities: As a software developer at Fortinet, you will:    •Implement and maintain software that drives our UTM feature set   •Stay on top of new developments in application-layer protocols and software development and suggest improvements within the team  •Promote best practices within the team and organization  •Provide product improvement suggestions while using Fortinet firewalls on a daily basis  •Research, investigate and define new areas of technology to enhance existing product or new product directions; re-evaluate the design and implementation of current source code   Job Skills Required:   •5+ years of C/C++ experience  •Capable of switching focus in various situations and applying themselves to quickly learning new technologies and adopting new methodologies   •Excellent problem solving and troubleshooting skills   •Experience developing software in a Linux or UNIX-like environment   •Experience with TCP/IP, firewalls, application-layer network software   •The ideal candidate has good knowledge of TCP/IP, POSIX APIs, and has a strong grasp of sockets.  •Experience using source control software (SVN, git or others)  Assets:   •Understanding of networking and security concepts   •Experience with scripting is a plus (shell, Python, Perl)   •Basic understanding of Linux or UNIX-like server/system management  Educational Requirements:    •Bachelors Degree in Computer Science or equivalent experience  #LI-MG1\n\n                    Category\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "Embedded Software Developer", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionAs a fast growing successful organization, Fortinet Technologies is looking for an upbeat C Guru to join our team. We are looking for a junior to intermediate level developer. This position offers variety and direct involvement with complex, innovative technology; as well as the opportunity to work with a close knit team of experienced and talented developers. As an Embedded Software Developer at Fortinet, you will be responsible for the full development cycle of newer and award winning flagship Fortinet products. You will be given the opportunity to participate in the development cycle from troubleshooting and testing to participation in the design and development of new features. You will work with the latest technologies for our next generation high performance distributed security systems. Join our team of enthusiastic developers and become a leader in network security. More Senior? If you enjoy being involved in entire development lifecycle of complex software, naturally take ownership in projects, comfortably interact with cross-functional departments, and enjoy mentoring emerging developers, you will find Fortinet has a platform to support your professional success. Job Responsibilities:   •Development, design and test the software for Fortinet products  •Hands on in bug fixing  •Maintain and document code using source control system  •Maintenance, performance tuning, and support of implemented software or firmware products  •Implement new features according to identified specs  Job Skills Required:   •C/C++ experience  •Experience with TCP/IP, Firewall, UTM  •Software development experience in Unix/Linux environment  •Capable of switching focus in various situations and apply themselves to quickly learning new technologies and adopting new methodologies  •Excellent problem solving and troubleshooting skills  •Relational database skills is an asset  Educational Requirements:   •Bachelor's Degree (Masters or PhD is an asset) in Computer Science or similar degree  #GD #LI-MG1\n\n                    Category\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "Embedded Software Developer", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionFortinet is looking for C Developers with a passion to improve and expand the rich feature set of our FortiGate firewall. You will join a dedicated team that is creating a compelling and innovative Unified Threat Management feature set (Anti-Virus, Web Filter, Data Leak Prevention and Anti-Spam). You love tackling challenging problems and take pride in writing clean, well thought-out code. You use and create tools that improve development processes, allowing you to focus on development. Most of all, you are driven to learn and grow -- making your work rewarding and FortiGate the best it can be for our users.   Job Responsibilities:   As a software developer at Fortinet, you will:    • Implement and maintain software that drives our UTM feature set   • Stay on top of new developments in application-layer protocols and software development and suggest improvements within the team   • Promote best practices within the team and organization   • Provide product improvement suggestions while using Fortinet firewalls on a daily basis   • Research, investigate and define new areas of technology to enhance existing product or new product directions; re-evaluate the design and implementation of current source code    Job Skills Required:    • 5+ years of C/C++ experience   • Capable of switching focus in various situations and applying themselves to quickly learning new technologies and adopting new methodologies   • Excellent problem solving and troubleshooting skills   • Experience developing software in a Linux or UNIX-like environment   • Experience with TCP/IP, firewalls, application-layer network software   • The ideal candidate has good knowledge of TCP/IP, POSIX APIs, and has a strong grasp of sockets.   • Experience using source control software (SVN, git or others)    Assets:    • Understanding of networking and security concepts   • Experience with scripting is a plus (shell, Python, Perl)   • Basic understanding of Linux or UNIX-like server/system management    Educational Requirements:     • Bachelors Degree in Computer Science or equivalent experience   #GD #LI-MG1\n\n                    Category\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "SRE Edge Engineer", "company": "Swim Recruiting", "date": "Mar. 20, 2024", "location": "<br/>\nVancouver, BC<br/>\nCanada, <br/>\nRemote, <br/>\n</div>", "descrip": "\n                    6-month contract Edge Network Engineer role with a global enterprise organization located in Vancouver\n\n6-month Edge Network Engineer contract role\nGlobal enterprise organization\nRemote work capability with offices located in downtown Vancouver\n\nWhat & Why:  Due to investment in digital, our client is looking to add two engineers to their team who have experience with CDN and website hosting experience. You will be working closely with the development teams and product owners to plan and deploy new CDN, Security and Performance related infrastructure and configurations.  You will work primarily with AWS and Akamai routing, caching, DNS and Security products to support the digital feature delivery. An ability to understand and communicate complex networking strategies is extremely important and a focus on stability and performance is a must.Who: This client is one of the most recognizable Canadian brands, a true Vancouver success story who has expanded globally. They are well known for their corporate culture and has won major awards for their accomplishments. They have invested majorly in technology and have had an incredibly successful past few years, including a major strategic acquisition. They have an all-star leadership team who keeps you accountable and provides support while still affording you tremendous autonomy. They are located close to rapid transit in newly renovated offices in downtown Vancouver and have a hybrid work environment with three days a week in office.You:You will bring the following education, skills and experience to the role:\n\n5 or more years of experience in a Web Performance or Web Development-related role.\nGood understanding of web technologies (HTTP, SSL, Headers, Cookies, TCP, Caching).\nAdvanced knowledge of Cloudflare, Akamai, or other CDN solutions\nGreat understanding of HTTP waterfalls and browser performance metrics\nExperience in working with security products like SHAPE (F5), WAF, DDoS, and Bot Mitigation tools.\nExperience in implementing Edge/Workers, API and automation.\nExposure to bug tracking and task management software such as JIRA, Bugzilla, etc.\nAbility to review traffic logs and develop WAF and Bot Mitigation strategies.\nUnderstanding of website analytics tools, synthetic monitoring, RUM tools like Blue Triangle or mPulse, and monitoring/alerting\nmethodologies like Splunk.\nSome programming/scripting knowledge would be a plus (preferably Python, Javascript, or PHP)\n\nNext Steps:  If the sound of this opportunity excites you, and you’re confident that it’s a good fit for your experience and career goals, then we’d love to hear from you! Please send your updated resume to us by applying to this posting and one of our awesome team of recruiters will be in touch.\n\n                    Category\n Information Technology\n", "details": ["\n\n                                11 days ago\n                            ", "\n\n                                    100 to 115 per hour\n                                ", " Vancouver, BC", " Contract", " Information Technology"]}, {"title": "Embedded Software Developer", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionAs an Embedded Software Developer at Fortinet, you will be responsible for the full development cycle of newer and award winning flagship Fortinet products. You will be given the opportunity to participate in the development cycle from troubleshooting and testing to participation in the design and development of new features. You will work with the latest technologies for our next generation high performance distributed security systems.   The team we hiring for is focused on developing key components of FortiAnalyzer, which deals with performance and scalability for data analysis of security log data.   Job Responsibilities:    • Development, design and test the software for Fortinet products   • Hands on in bug fixing   • Maintain and document code using source control system   • Maintenance, performance tuning, and support of implemented software or firmware products   • Implement new features according to identified specs     Skills Required:     • 1+ years of projects/industry experience with development focus on C/C++ programming   • Knowledge in database, data warehouse, data mining   • Knowledge in database API and PostgreSQL language   • Experience in analysis and tune up performance for database   • Knowledge in network and socket programming   • Experience with TCP/IP, Firewall, UTM is preferred   • Software development experience in Unix/Linux environment   • Excellent problem solving and troubleshooting skills   • Relational database skills is an asset     Educational Requirements:     • Bachelors Degree (Masters or PhD is an asset) in Computer Science or similar degree    #GD   #LI-HP1\n\n                    Category\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "Manager, Data Center Operations", "company": "BCLC", "date": "Mar. 24, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\n                    Manager, Data Center Operations Location:   Remote within, BC, CA Job Function:  Information Technology  BCLC exists to generate win-wins for the greater good.     For our people, our players, our communities, our industry, and our planet.     Lottery | Casino | Sports  Being a social purpose company, we are not only able to better align our business decisions with our purpose, but more importantly, we are committing to doing our part in creating a better world.    We bring our purpose to life by ensuring all our actions, behaviours and decisions create benefits for communities and the planet.    Motivated and guided by our social purpose, everything we do must benefit the greater good. And we encourage our employees, partners, players, industry and communities to engage with us on this ambition.      We want you to be where you feel you can do your best work. Most of our jobs can be done remotely providing you reside in BC.      For those who prefer working in a community with others, we have two beautiful offices in convenient locations:                     2940 Virtual Way, Vancouver | 74 Seymour Street W, Kamloops      This is a Permanent, Full Time opportunity     Expected Salary Range: $101,122.00 - $126,403.00 - $158,003.00                     Our typical hiring range will be +/- 10% of the midpoint shown above                     Factors influencing this decision include qualifications and market conditions for the role    The Company    For over three decades, BCLC has delivered exceptional gambling entertainment for British Columbians. To fulfill our social purpose we have a vision to revolutionize gambling entertainment through engaging experiences that build and benefit communities. We operate national and provincial lotteries in partnership with 3500 retail partners, provide the games, technology & oversight to 37 brick & mortar casinos, and operate a safe secure and 100% legal online gambling presence PlayNow.com. In our recently completed fiscal year, BCLC generated a record $1.6 billion in net income to the Province of B.C. to support First Nations, local host governments, health care, education and community programs across the province.   Job Summary:   The Capability Manager, Data Center Operations is responsible for leading a technical capability or \"Pod\" within BCLC Business Technology to drive value for its members and the corporation by leading the strategy and planning for the Pod, developing methodology, defining processes, standards, and best practices, and selecting tools; manages people and financial resources, including vendors and contractors.   The role leads all the members within their capability employing influence and servant leadership over positional power to drive results, including development, success planning, and performance management and coaching.    As we continue to build out a full Cloud Transformation program, the Capability Manager, Data Center Operations will shape the future of our service operations capabilities and processes designed to improve the effectiveness of our technology operations, while supporting and adapting the running of the business, managing, and maintaining data center facilities, ensuring the continuous availability and optimal performance of our core operations and critical business services:    Key Accountabilities:   Provides leadership and coaching to a capability pod with aligned skill sets.  Models leadership behaviors that support engagement of teams by practicing meaningful recognition, inspiring a shared vision, coaching/mentoring and developing others, performance assessments and supporting culture and change management initiatives.    Develops and manages the strategy, planning, methodology, process, standards, best practices, implementation and advice for the capability pod, including oversight of applicable technologies and systems.   Ensure the capability pod workforce has the capabilities, skill sets and resources to effectively deliver on short and long term strategic business objectives.  Assesses current workforce to identify and action skills gaps.  Promotes the development of T-skills among Pod members.   Guides recruitment initiatives for capability pod with the support of HR.  Develops talent pipelines for roles, including the identification of succession planning candidates for placement into development roles.   Partners with other capability pods to ensure that processes and tools are aligned and support the BT organization and systems as a whole.   Manages vendor performance and contracts including creating Statements of Work (SOW), and Requests for Proposal (RFP).   Researches best practices in technical area; incorporating research into overall strategy and plans for pod development.   Manages budget for capability; managing salary, contract and development resources.     Rationalize and leverage various monitoring tools to consistently meet published Service Level agreement for system availability, detect issues sooner and pinpoint root causes of those issues more efficiently.   Key leadership role to plan and transition our data center footprint from on-premises compute to Cloud, including roadmap development and Evergreen requirements.   Evolve and operationalize the capability to provide real-time insights and enable processes to proactively reduce and remediate incidents, enhance visibility across technology stacks and improve the player and employee experience with powerful insights to inform decision-making and create positive business outcomes, detecting issues even before players get impacted, elevating the nature of our service from being reactive to pro-active.       Evolve the current model and establish standards to achieve effectiveness and consistency in supporting the running of the business 24/7 across the enterprise.   Establish an incident response framework, at agreed service levels, that enables agile teams to efficiently address and scale their response during an incident while ensuring clear and concise messaging for various types of audiences.   Minimum Required Qualifications: Education and Experience   A University degree or diploma in a relative discipline supplemented by industry recognized professional courses   Minimum 5 - 7 years relevant experience in technical capability including 3 years' experience in a leadership role, which may include people leadership or coaching/mentoring experience.     Equivalent combination of education and/or experience may be considered.    Technical Requirements   Demonstrated leadership and coaching skills and the ability to build strong and trusting relationships with managers, employees and peers.   Demonstrated experience in strategic business planning and resource management in a leadership capacity.   Excellent organizational and planning skills with a strong attention to detail; project management skills and meets tight timeframes and commitments and is accountable for results.    Strong technical background and experience with systems development, quality assurance best practices and hardware technology.   A collaborative outcome-focused mindset and a drive to continuously improve and evolve service, operations capabilities and solving problems for business partners.   Excellent written and verbal communication skills.   Excellent problem solving and analytical thinking/innovation.   Strong computer skills - MS office suite.   Believes in continuous improvement and driven to question and improve processes, systems, practices as appropriate.   Strong strategic thinking skills - ability to find innovative yet practical strategies to achieve goals, links several strategies into a unified plan, while anticipating needs and looking future focused;   Vendor and contract management, SLA's and service management;   Strong business acumen with a results oriented focus;   Understanding of B.C. gaming industry is an asset.   Experience with agile software development methodologies (Scrum, Kanban, etc.) is an asset   Experience adapting traditional enterprise support model within the context of an agile operating model is a strong asset.   What's in it for you   Defined benefit pension plan which provides a recurring income you can depend on for life throughout retirement   We pride ourselves on our flexible working model which supports work-life integration and our 37.5 hour work week   Professional development including education/certification sponsorship, in house leadership cohorts, LinkedIn Learning   See all our rewards  here   However you identify, or whatever your path in life, if you see something here that makes you excited to get to work every day, please apply. We hire people for skills, capabilities and potential, not just education and experience.    We value Respect, Integrity and Community, and we provide an inclusive environment where everyone can feel like they belong .    Our social purpose is much more than returning 100% of net income to the province in the form of healthcare & education programs, and community gaming grants. Check it out !    Did you know BCLC is an industry leader in player health and safe & responsible gambling? Find out more !    We are trained in neurodivergent hiring. If you require accommodation so you can be at your best in the interview, please let us know: recruitment@bclc.com .   All candidates must be at least 19 years of age and legally eligible to work in Canada  \nCategory\n Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Full Time", " Information Technology"]}, {"title": "Mobile Developer", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionFortinet has an exciting opportunity for a Mobile Developer capable of leading a team responsible for building the next generation of mobile firewall management software. Fortinet is looking for candidates with a strong mobile development background, leadership potential and a passion for creating user-friendly, powerful interfaces. You will work closely with the user interface, product management and other development teams responsible for our Fortigate product. To see an example of the work done by this team go to the Apple App Store and try out our FortiExplorer product!  To find out more about what it is like working for the team, watch this video - https://www.youtube.com/watch?v=zx56_G2RnjE  Job Responsibilities:   •Design and develop software for Fortinet mobile applications  •Troubleshoot, identify and improve product quality following QA testing and customer feedback  •Maintain, improve and support existing software products  •Collaborate with other teams to integrate product functionality  Job Skills Required:   •Software development experience in an Android or iOS environment  •Proven track record of designing and building applications for Android and/or iOS  •Hands-on experience with Kotlin/Java or Swift  •Flutter/Dart experience is an asset  •Experience with Git or Subversion and continuous integration is a plus  •Experience with TCP/IP networking and network security  •Experience with Unit testing/TDD  #GD #LI-CN1\n\n                    Category\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "Solution Architect, Deloitte Global Technology", "company": "Deloitte", "date": "Mar. 24, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\nJob Type:Permanent Reference code:124920 Primary Location:Toronto, ON All Available Locations:Toronto, ON  Our Purpose   At Deloitte, we are driven to inspire and help our people, organization, communities, and country to thrive. Our Purpose is to build a better future by accelerating and expanding access to knowledge. Purpose defines who we are and gives us reason to exist as an organization. By living our Purpose, we will make an impact that matters.  Enjoy flexible, proactive, and practical benefits that foster a culture of well-being and connectedness. Experience a firm where wellness matters. Be expected to share your ideas and to make them a reality. What will your typical day look like? In your role as a Solution Architect, you will be responsible for envisioning and developing new digital products.You will execute day-to-day product development activities across design, development, stakeholder communication, technology vendor management and delivery. Responsibilities:  Lead clients, complex projects, drive business requirement gathering, manage scope and client expectations Design long-term, reliable, and end-to-end technical architectures. Develop functional architecture design and contribute to product vision Transforms detailed requirements into a complete, detailed systems design document Supports creation of interface specifications and call flows for the various components in the design Provide inputs to create Agile user stories based on marketing business requirements Provide technical support for analysis of business requirements and applicability to the current or planned Platform/Enabler/API Platform capabilities Participate in end-to-end functionality assessment during solution testing phases Serve as a technical liaison between the business, project team and developers/testers Collaborate with IT infrastructure teams (DevOps, Cyber, networking) to deploy and maintain applications About the team  Deloitte Technology Services works at the forefront of technology development and processes to support and protect Deloitte around the world. In this truly global environment, we operate not in \"what is\" but rather \"what can be\" to help Deloitte deliver and connect with its clients, its communities, and one another in ways not previously conceived. Enough about us, let's talk about you You bring:  Minimum of 10+ years of industry related experience (financial services, government or banking) Minimum of 7+ years in an architect capacity Minimum of 5+ years of experience in leading architecture activities like designing, roadmap, & proof-of-concepts. Prior experience in native application architecture and deployment in Microsoft Azure Proven ability to lead multiple customers, complex projects, and multiple initiatives Prior hands-on experience in web-based technologies including Microsoft .Net, ASP.NET Web API and complementary business layer and front-end technologies like AngularJs, ReactJs, NodeJS, etc., Prior hands-on experience with Microsoft SQL Server, MongoDB, Cosmos DB, Oracle etc., A Bachelor's degree or equivalent in Computer Science, Business Administration, or related discipline. While an advanced degree is preferred, the value is placed on the extent of the relevant experience and accomplishments Ability to travel and / or work from a Deloitte office 10-15% of time  Preferred  Microsoft Azure certifications (AZ300 through and including Azure 305) Experience working with SAFe or Agile development processes Exposure to Cloud Cognitive Services and AI platforms TOGAF or SEI - Software Architecture Certification etc., Familiarity with PowerBI or similar enterprise-class reporting / analytics tools Total RewardsThe salary range for this position is $85,000 - $156,000, and individuals may be eligible to participate in our bonus program. Deloitte is fair and competitive when it comes to the salaries of our people. We regularly benchmark across a variety of positions, industries, sectors, targets, and levels. Our approach is grounded on recognizing people's unique strengths and contributions and rewarding the value that they deliver.Our Total Rewards Package extends well beyond traditional compensation and benefit programs and is designed to recognize employee contributions, encourage personal wellness, and support firm growth. Along with a competitive base salary and variable pay opportunities, we offer a wide array of initiatives that differentiate us as a people-first organization. Some representative examples include: $4,000 per year for mental health support benefits, a $1,300 flexible benefit spending account, 38+ days off (including 10 firm-wide closures known as \"Deloitte Days\"), flexible work arrangements and a hybrid work structure.Our promise to our people: Deloitte is where potential comes to life.   Be yourself, and more. We are a group of talented people who want to learn, gain experience, and develop skills. Wherever you are in your career, we want you to advance. You shape how we make impact. Diverse perspectives and life experiences make us better. Whoever you are and wherever you're from, we want you to feel like you belong here. We provide flexible working options to support you and how you can contribute. Be the leader you want to be. Be the leader you want to be  Some guide teams, some change culture, some build essential expertise. We offer opportunities and experiences that support your continuing growth as a leader. Have as many careers as you want. We are uniquely able to offer you new challenges and roles - and prepare you for them. We bring together people with unique experiences and talents, and we are the place to develop a lasting network of friends, peers, and mentors. Our TVP is about relationships - between leaders and their people, the firm and its people, peers, and within in our communities.The next step is yours   At Deloitte, we are all about doing business inclusively - that starts with having diverse colleagues of all abilities. Deloitte encourages applications from all qualified candidates who represent the full diversity of communities across Canada. This includes, but is not limited to, people with disabilities, candidates from Indigenous communities, and candidates from the Black community in support of living our values, creating a culture of Diversity Equity and Inclusion and our commitment to our AccessAbility Action Plan , Reconciliation Action Plan and the BlackNorth Initiative .  We encourage you to connect with us at accessiblecareers@deloitte.ca if you require an accommodation for the recruitment process (including alternate formats of materials, accessible meeting rooms or other accommodations) or indigenouscareers@deloitte.ca for any questions relating to careers for Indigenous peoples at Deloitte (First Nations, Inuit, Métis). By applying to this job you will be assessed against the Deloitte Global Talent Standards. We've designed these standards to provide our clients with a consistent and exceptional Deloitte experience globally. Deloitte Canada has 30 offices with representation across most of the country. We acknowledge our offices reside on traditional, treaty and unceded territories as part of Turtle Island and is still home to many First Nations, Métis, and Inuit peoples. We are all Treaty people.Job Segment:  Developer, Solution Architect, ERP, Front End, Cloud, Technology\n\n                    Category\n Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Full Time", " Information Technology"]}, {"title": "Senior Manager - Business Information Security (BISO), Deloitte Global Technology", "company": "Deloitte", "date": "Mar. 23, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\nJob Type:Permanent Work Model:Hybrid Reference code:126047 Primary Location:Toronto, ON All Available Locations:Ottawa, ON  Our Purpose   At Deloitte, we are driven to inspire and help our people, organization, communities, and country to thrive. Our Purpose is to build a better future by accelerating and expanding access to knowledge. Purpose defines who we are and gives us reason to exist as an organization. By living our Purpose, we will make an impact that matters.  Enjoy flexible, proactive, and practical benefits that foster a culture of well-being and connectedness. Experience a firm where wellness matters. Be expected to share your ideas and to make them a reality. Deloitte Global is the engine of the Deloitte network. Our professionals reach across disciplines and borders to develop and lead global initiatives. We deliver strategic programs and services that unite our organization.What will your typical day look like?As the Business Information Security (BISO) Senior Manager you will serve as a trusted advisor to solution architects, developers, technical risk analysts and others oninformation security principles, standards, and best practices. Key Responsibilities:   Understand the assigned global line of business, gain familiarity with priorities and become an advocate forthe line of business within cybersecurity. Drive organizational change and work with multiple business units of a large organization to effect change. Oversee and help drive design and implementation of application security controls in support of compliancerequirements using secure design and development methodologies. Support the Secure Systems Development Lifecycle (SSDLC), including functional and non-functionalcybersecurity requirements. Strive for process improvement and automation; help development and operations team build automationfor repeatable Cyber related vulnerability management activities. Maintain awareness of evolving application security threats and inform development, business, and riskstakeholders. Provide application-specific security subject matter expertise to assigned customers. Evaluate the likelihood and impact of application vulnerabilities; develop and drive mitigation approaches. Lead, coach, and mentor project teams to incorporate security into enterprise and client-facing applications. About the teamDeloitte Technology works at the forefront of technology development and processes to support and protect Deloitte around the world. In this truly global environment, we operate not in \"what is\" but rather \"what can be\" to help Deloitte deliver and connect with its clients, its communities, and one another in ways not previously conceived.Enough about us, let's talk about youRequired:  10+ years of related experience, including cybersecurity and/or risk management experience in organizations of a similar scale or client-service experience in the field. Minimum 5 years of experience in application security, software development, and/or security architecture. Minimum 5 years of leadership / team management experience. C-level and executive interaction experience. Demonstrated experience driving strategy with cross-functional executive level stakeholders. Demonstrated ability to drive organizational change and work with multiple business units of a large organization to effect change. Exceptional verbal and written communication skills. Must be able to interact effectively with professionals at all levels and communicate recommendations with diplomacy and tact. Knowledge of Azure, AWS, and GCP technologies. Experience conducting or managing application penetrating and/or vulnerability testing. Experience with cloud security principles and functions. Experience developing and communicating application security vision, strategy and roadmap. Familiarity with SOC 2 principles; experience in application security to meet SOC 2 requirements preferred. Solid capabilities across multiple security domains such as identity and access management (IAM), public-key encryption, security information and event management (SIEM), incident response, threat & vulnerability management Total RewardsThe salary range for this position is $104,000 - $215,000, and individuals may be eligible to participate in our bonus program. Deloitte is fair and competitive when it comes to the salaries of our people. We regularly benchmark across a variety of positions, industries, sectors, targets, and levels. Our approach is grounded on recognizing people's unique strengths and contributions and rewarding the value that they deliver.Our Total Rewards Package extends well beyond traditional compensation and benefit programs and is designed to recognize employee contributions, encourage personal wellness, and support firm growth. Along with a competitive base salary and variable pay opportunities, we offer a wide array of initiatives that differentiate us as a people-first organization. Some representative examples include: $4,000 per year for mental health support benefits, a $1,300 flexible benefit spending account, 38+ days off (including 10 firm-wide closures known as \"Deloitte Days\"), flexible work arrangements and a hybrid work structure.Our promise to our people: Deloitte is where potential comes to life.   Be yourself, and more. We are a group of talented people who want to learn, gain experience, and develop skills. Wherever you are in your career, we want you to advance. You shape how we make impact. Diverse perspectives and life experiences make us better. Whoever you are and wherever you're from, we want you to feel like you belong here. We provide flexible working options to support you and how you can contribute. Be the leader you want to be. Be the leader you want to be  Some guide teams, some change culture, some build essential expertise. We offer opportunities and experiences that support your continuing growth as a leader. Have as many careers as you want. We are uniquely able to offer you new challenges and roles - and prepare you for them. We bring together people with unique experiences and talents, and we are the place to develop a lasting network of friends, peers, and mentors. Our TVP is about relationships - between leaders and their people, the firm and its people, peers, and within in our communities.The next step is yours   At Deloitte, we are all about doing business inclusively - that starts with having diverse colleagues of all abilities. Deloitte encourages applications from all qualified candidates who represent the full diversity of communities across Canada. This includes, but is not limited to, people with disabilities, candidates from Indigenous communities, and candidates from the Black community in support of living our values, creating a culture of Diversity Equity and Inclusion and our commitment to our AccessAbility Action Plan , Reconciliation Action Plan and the BlackNorth Initiative .  We encourage you to connect with us at accessiblecareers@deloitte.ca if you require an accommodation for the recruitment process (including alternate formats of materials, accessible meeting rooms or other accommodations) or indigenouscareers@deloitte.ca for any questions relating to careers for Indigenous peoples at Deloitte (First Nations, Inuit, Métis). By applying to this job you will be assessed against the Deloitte Global Talent Standards. We've designed these standards to provide our clients with a consistent and exceptional Deloitte experience globally. Deloitte Canada has 30 offices with representation across most of the country. We acknowledge our offices reside on traditional, treaty and unceded territories as part of Turtle Island and is still home to many First Nations, Métis, and Inuit peoples. We are all Treaty people.Job Segment:  Information Security, Cyber Security, Developer, Cloud, Testing, Technology, Security\n\n                    Category\n Management and Executive\n", "details": ["\n\n                                7 days ago\n                            ", " Full Time", " Management and Executive"]}, {"title": "Senior Consultant - GenAI Product Management", "company": "Deloitte", "date": "Mar. 27, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\nJob Type:Permanent Reference code:125970 Primary Location:Toronto, ON All Available Locations:Toronto, ON  Our Purpose   At Deloitte, we are driven to inspire and help our people, organization, communities, and country to thrive. Our Purpose is to build a better future by accelerating and expanding access to knowledge. Purpose defines who we are and gives us reason to exist as an organization. By living our Purpose, we will make an impact that matters.  Build your leadership skills at Deloitte University. Enjoy My Benefit Dollars - a flexible benefit to support your physical, financial and emotional well-being. Be expected to share your ideas and to make them a reality. Join our Generative AI team and shape the future of AI!What will your typical day look like?Work in a fast growing and exciting organization with professionals who are eminent in their respective field.  Have challenging and interesting work in a team environment. Continue your development throughout your career to reinforce and expand your chosen career path.   Role Specific Responsibilities:   Product Strategy and Vision: Define and articulate the product vision and strategy for multiple generative AI applications, ensuring alignment with the company's strategic objectives and market demand. Roadmap Development: Develop and maintain a product roadmap, prioritizing features and initiatives based on business impact, customer value, and technological feasibility. Product Lifecycle Management: Manage the entire product lifecycle, from conception through launch, growth, and eventual sunset. Make data-driven decisions to iterate, improve, or pivot product features and strategies. Collaborate with stakeholders across the organization to elicit, analyze, and document business requirements for Generative AI initiatives. Design and model new processes, incorporating technology solutions to support business objectives and improve user experience. Conduct in-depth analysis of business processes, systems, and workflows to identify improvement opportunities and implement strategic solutions. Customer Insights: Gather and analyze customer feedback and usage data to understand customer needs and pain points. Incorporate insights into product development to ensure the product meets and exceeds customer expectations. Develop a deep understanding of Deloitte's structured & unstructured data and use that knowledge to develop recommend new and innovative features for the product. Stakeholder Engagement: Communicate effectively with stakeholders, translating complex AI concepts into understandable insights and updates.  About the teamThe Generative AI CoE is an internal team within Deloitte's ITS (Information Technology Services) organization. GenAI CoE focuses on delivering end-to-end solutions that leverage Generative AI technology including custom built & commercially available products.Enough about us, let's talk about youYou are a senior consultant who specializes in Generative AI. You have practical experience with Generative AI, excellent analytical skills, and a thorough knowledge of business processes. You are skilled in leading requirement workshops, process design sessions, feature elaboration discussions and communicating with engineers and developers. Experience Required:  At least 3-5 years of experience in product management, with a significant focus on AI-driven products. Experience with generative AI technologies is highly desirable. Expertise in Software Product Management disciplines such building roadmaps, systems operations, and regular maintenance cycle management. Technical Knowledge: Strong understanding of AI, GenAI and machine learning concepts and technologies. Familiarity with the development, deployment, and scaling of AI products. Proven ability to develop product strategies and visions. Experience conducting market research, competitive analysis, and identifying customer needs. Solid understanding of agile development methodologies. Experience with agile product development tools and processes. Exceptional analytical and problem-solving abilities. Comfortable making data-driven decisions and using metrics to guide product development. Experience in business analysis and process development. Excellent analytical skills, with the ability to use data to inform product decisions and drive continuous improvement. Strong cross-functional collaboration skills, with the ability to work effectively with engineering, design, data science, and business development teams. Excellent communication skills, with the ability to clearly articulate complex product concepts to both technical and non-technical stakeholders. Bachelor's degree in computer science, Engineering, Business, or a related field  Total RewardsThe salary range for this position is $69,000 - $114,000, and individuals may be eligible to participate in our bonus program. Deloitte is fair and competitive when it comes to the salaries of our people. We regularly benchmark across a variety of positions, industries, sectors, targets, and levels. Our approach is grounded on recognizing people's unique strengths and contributions and rewarding the value that they deliver.Our Total Rewards Package extends well beyond traditional compensation and benefit programs and is designed to recognize employee contributions, encourage personal wellness, and support firm growth. Along with a competitive base salary and variable pay opportunities, we offer a wide array of initiatives that differentiate us as a people-first organization. Some representative examples include: $4,000 per year for mental health support benefits, a $1,300 flexible benefit spending account, 38+ days off (including 10 firm-wide closures known as \"Deloitte Days\"), flexible work arrangements and a hybrid work structure.Our promise to our people: Deloitte is where potential comes to life.   Be yourself, and more. We are a group of talented people who want to learn, gain experience, and develop skills. Wherever you are in your career, we want you to advance. You shape how we make impact. Diverse perspectives and life experiences make us better. Whoever you are and wherever you're from, we want you to feel like you belong here. We provide flexible working options to support you and how you can contribute. Be the leader you want to be. Be the leader you want to be  Some guide teams, some change culture, some build essential expertise. We offer opportunities and experiences that support your continuing growth as a leader. Have as many careers as you want. We are uniquely able to offer you new challenges and roles - and prepare you for them. We bring together people with unique experiences and talents, and we are the place to develop a lasting network of friends, peers, and mentors. Our TVP is about relationships - between leaders and their people, the firm and its people, peers, and within in our communities.The next step is yours   At Deloitte, we are all about doing business inclusively - that starts with having diverse colleagues of all abilities. Deloitte encourages applications from all qualified candidates who represent the full diversity of communities across Canada. This includes, but is not limited to, people with disabilities, candidates from Indigenous communities, and candidates from the Black community in support of living our values, creating a culture of Diversity Equity and Inclusion and our commitment to our AccessAbility Action Plan , Reconciliation Action Plan and the BlackNorth Initiative .  We encourage you to connect with us at accessiblecareers@deloitte.ca if you require an accommodation for the recruitment process (including alternate formats of materials, accessible meeting rooms or other accommodations) or indigenouscareers@deloitte.ca for any questions relating to careers for Indigenous peoples at Deloitte (First Nations, Inuit, Métis). By applying to this job you will be assessed against the Deloitte Global Talent Standards. We've designed these standards to provide our clients with a consistent and exceptional Deloitte experience globally. Deloitte Canada has 30 offices with representation across most of the country. We acknowledge our offices reside on traditional, treaty and unceded territories as part of Turtle Island and is still home to many First Nations, Métis, and Inuit peoples. We are all Treaty people.Job Segment:  Senior Product Manager, PLM, Product Manager, Management Consulting, Developer, Operations, Management, Technology\n\n                    Category\n Management and Executive\n", "details": ["\n\n                                3 days ago\n                            ", " Full Time", " Management and Executive"]}, {"title": "Embedded Software Developer", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionAs a fast growing successful organization, Fortinet Technologies is looking for an upbeat C Guru to join our team. We are looking for a junior to intermediate level developer. This position offers variety and direct involvement with complex, innovative technology; as well as the opportunity to work with a close knit team of experienced and talented developers.   As an Embedded Software Developer at Fortinet, you will be responsible for the full development cycle of newer and award winning flagship Fortinet products. You will be given the opportunity to participate in the development cycle from troubleshooting and testing to participation in the design and development of new features. You will work with the latest technologies for our next generation high performance distributed security systems. Join our team of enthusiastic developers and become a leader in network security.   More Senior? If you enjoy being involved in entire development lifecycle of complex software, naturally take ownership in projects, comfortably interact with cross-functional departments, and enjoy mentoring emerging developers, you will find Fortinet has a platform to support your professional success.    Job Responsibilities:     • Development, design and test the software for Fortinet products   • Hands on in bug fixing   • Maintain and document code using source control system   • Maintenance, performance tuning, and support of implemented software or firmware products   • Implement new features according to identified specs     Job Skills Required:     • C/C++ experience   • Experience with TCP/IP, Firewall, UTM   • Software development experience in Unix/Linux environment   • Capable of switching focus in various situations and apply themselves to quickly learning new technologies and adopting new methodologies   • Excellent problem solving and troubleshooting skills   • Relational database skills is an asset     Educational Requirements:     • Bachelors Degree (Masters or PhD is an asset) in Computer Science or similar degree    #GD   #LI-MG1Fortinet (NASDAQ: FTNT) secures the largest enterprise, service provider, and government organizations around the world. Fortinet empowers its customers with intelligent, seamless protection across the expanding attack surface and the power to take on ever-increasing performance requirements of the borderless network - today and into the future. Only the Fortinet Security Fabric architecture can deliver security features without compromise to address the most critical security challenges, whether in networked, application, cloud or mobile environments. Fortinet ranks number one in the most security appliances shipped worldwide and more than 450,000 customers trust Fortinet to protect their businesses. \nCategory\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "Release QA Specialist", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionFortinet is looking for a Software QA to join our team. You will be responsible for develop, maintain, and automate QA testing environment for Fortinet's FortiEDR platform and infrastructures. This is an exciting opportunity to learn and work with the latest cyber security technologies.  Job Responsibilities:   •Setup and maintain lab environment.  •Execute feature and bug fix testing using a combination of manual and automated testing techniques.  •Identify, document and track software defects found during functionality, performance and detection coverage testing.  •Improve testing and development processes using various automation techniques.  •Develop, maintain and execute tools and scripts using shell, Python or other languages.  •Work closely with developers to ensure defects are correctly identified and fixed.  •Work with different teams to ensure FortiEDR is certified by independent organizations.  Job Skills Required:   •1 - 2 years of software quality assurance or network administrator experience in IT or related industry.  •Knowledge of endpoint detection and response(EDR), antivirus, firewalls, and TCP/IP networking.  •Knowledge of general QA procedures and methodologies, as well as software development fundamentals.  •Knowledge of Virtual machine environment, i.e VMware / ESXi, Hypervisor.  •Demonstrated ability to write clear and reproducible problem reports, and test results.  •Demonstrated skills in scripting languages, such as shell, Python are considered assets.  •Experience with Linux and Windows administration.  •Experience with code review systems and bug tracking services is an asset.  •Experience with benchmark testing platforms/software such as BreakingPoint is an asset.  •Ability to work in a collaborative environment and communicate well with other teams.  •Ability to work on assigned tasks under tight time constraints.  Educational Requirements: A degree or technical diploma in Computer Science, Computer Technology, or related field. #GD #LI-MIMI\n\n                    Category\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "Manager, Risk and Contract Management", "company": "Deloitte", "date": "Mar. 24, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\nJob Type:Permanent Reference code:125607 Primary Location:Toronto, ON All Available Locations:Toronto, ON  Our Purpose   At Deloitte, we are driven to inspire and help our people, organization, communities, and country to thrive. Our Purpose is to build a better future by accelerating and expanding access to knowledge. Purpose defines who we are and gives us reason to exist as an organization. By living our Purpose, we will make an impact that matters.   Be encouraged to deepen your technical skills...whatever those may be. Partner with clients to solve their most complex problems Be empowered to lead and have impact with clients, our communities and in the office. As a member of Deloitte's dynamic and talented Risk Management team, you'll have the opportunity to shape the risk profiles and mitigation strategies for our mission critical consulting projects.What will your typical day look like?Daily activities would include any/all of the following:   Reviewing draft contracts and requests for proposals for contractual risks and developing alternative contractual positions for negotiation Negotiating contractual language with clients / client legal representatives Developing and monitoring the implementation of risk mitigation strategies Drafting client contracts Serving as a single point of contact for both Deloitte engagement teams and our clients regarding contract related issues and issue resolution Communicating contract-related information to internal stakeholders Managing contract - related correspondence and record keeping About the teamOur risk team works closely with Canadian and Global Deloitte Consulting engagement teams to assist our clients in innovation, transformation, and leadership initiatives. The ability to solve complex client issues is critical to our consulting business. Together, our teams help clients imagine, deliver, and run their business using the latest technologies such as cloud and cognitive, from strategy development through implementation. We assist engagement teams and leadership with negotiating contractual terms for these initiatives, investigating and resolving complex contractual questions as well as in managing and mitigating engagement delivery risks.Enough about us, let's talk about youYou are someone who has:   A minimum of five years progressive responsibility with quantifiable results in contract negotiation, contract administration and risk management in a large professional services organization The ability to balance conflicting priorities, work under pressure and meet tight deadlines Strong contract writing and contract analysis skills Robust skills in Microsoft Office software, including Word, Excel, PowerPoint, Access, Project and Visio A Bachelor's Degree with a MBA preferred Total RewardsThe salary range for this position is $85,000 - $156,000, and individuals may be eligible to participate in our bonus program. Deloitte is fair and competitive when it comes to the salaries of our people. We regularly benchmark across a variety of positions, industries, sectors, targets, and levels. Our approach is grounded on recognizing people's unique strengths and contributions and rewarding the value that they deliver.Our Total Rewards Package extends well beyond traditional compensation and benefit programs and is designed to recognize employee contributions, encourage personal wellness, and support firm growth. Along with a competitive base salary and variable pay opportunities, we offer a wide array of initiatives that differentiate us as a people-first organization. Some representative examples include: $4,000 per year for mental health support benefits, a $1,300 flexible benefit spending account, 38+ days off (including 10 firm-wide closures known as \"Deloitte Days\"), flexible work arrangements and a hybrid work structure.Our promise to our people: Deloitte is where potential comes to life.   Be yourself, and more. We are a group of talented people who want to learn, gain experience, and develop skills. Wherever you are in your career, we want you to advance. You shape how we make impact. Diverse perspectives and life experiences make us better. Whoever you are and wherever you're from, we want you to feel like you belong here. We provide flexible working options to support you and how you can contribute. Be the leader you want to be. Be the leader you want to be  Some guide teams, some change culture, some build essential expertise. We offer opportunities and experiences that support your continuing growth as a leader. Have as many careers as you want. We are uniquely able to offer you new challenges and roles - and prepare you for them. We bring together people with unique experiences and talents, and we are the place to develop a lasting network of friends, peers, and mentors. Our TVP is about relationships - between leaders and their people, the firm and its people, peers, and within in our communities.The next step is yours   At Deloitte, we are all about doing business inclusively - that starts with having diverse colleagues of all abilities. Deloitte encourages applications from all qualified candidates who represent the full diversity of communities across Canada. This includes, but is not limited to, people with disabilities, candidates from Indigenous communities, and candidates from the Black community in support of living our values, creating a culture of Diversity Equity and Inclusion and our commitment to our AccessAbility Action Plan , Reconciliation Action Plan and the BlackNorth Initiative .  We encourage you to connect with us at accessiblecareers@deloitte.ca if you require an accommodation for the recruitment process (including alternate formats of materials, accessible meeting rooms or other accommodations) or indigenouscareers@deloitte.ca for any questions relating to careers for Indigenous peoples at Deloitte (First Nations, Inuit, Métis). By applying to this job you will be assessed against the Deloitte Global Talent Standards. We've designed these standards to provide our clients with a consistent and exceptional Deloitte experience globally. Deloitte Canada has 30 offices with representation across most of the country. We acknowledge our offices reside on traditional, treaty and unceded territories as part of Turtle Island and is still home to many First Nations, Métis, and Inuit peoples. We are all Treaty people.Job Segment:  Risk Management, Cloud, Contract Manager, MBA, Manager, Finance, Legal, Technology, Management\n\n                    Category\n Management and Executive\n", "details": ["\n\n                                6 days ago\n                            ", " Full Time", " Management and Executive"]}, {"title": "Release QA Specialist", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionFortinet is looking for a Software QA to join our team. You will be responsible for develop, maintain, and automate QA testing environment for Fortinet's FortiEDR platform and infrastructures. This is an exciting opportunity to learn and work with the latest cyber security technologies.  Job Responsibilities:   •Setup and maintain lab environment.  •Execute feature and bug fix testing using a combination of manual and automated testing techniques.  •Identify, document and track software defects found during functionality, performance and detection coverage testing.  •Improve testing and development processes using various automation techniques.  •Develop, maintain and execute tools and scripts using shell, Python or other languages.  •Work closely with developers to ensure defects are correctly identified and fixed.  •Work with different teams to ensure FortiEDR is certified by independent organizations.  Job Skills Required:   •1 - 2 years of software quality assurance or network administrator experience in IT or related industry.  •Knowledge of endpoint detection and response(EDR), antivirus, firewalls, and TCP/IP networking.  •Knowledge of general QA procedures and methodologies, as well as software development fundamentals.  •Knowledge of Virtual machine environment, i.e VMware / ESXi, Hypervisor.  •Demonstrated ability to write clear and reproducible problem reports, and test results.  •Demonstrated skills in scripting languages, such as shell, Python are considered assets.  •Experience with Linux and Windows administration.  •Experience with code review systems and bug tracking services is an asset.  •Experience with benchmark testing platforms/software such as BreakingPoint is an asset.  •Ability to work in a collaborative environment and communicate well with other teams.  •Ability to work on assigned tasks under tight time constraints.  Educational Requirements: A degree or technical diploma in Computer Science, Computer Technology, or related field. #GD #LI-MIMI\n\n                    Category\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "Manager, Cloud Security Engineer - Deloitte Global Technology", "company": "Deloitte", "date": "Mar. 26, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\nJob Type:Permanent Work Model:Remote Reference code:126092 Primary Location:Toronto, ON All Available Locations:Toronto, ON; Burlington, ON; Calgary, AB; Edmonton, AB; Fredericton, NB; Halifax, NS; Kitchener, ON; Moncton, NB; Ottawa, ON; Regina, SK; Saint John, NB; Saskatoon, SK; St. John's, NL; Vancouver, BC; Victoria, BC; Winnipeg, MB  Our Purpose   At Deloitte, we are driven to inspire and help our people, organization, communities, and country to thrive. Our Purpose is to build a better future by accelerating and expanding access to knowledge. Purpose defines who we are and gives us reason to exist as an organization. By living our Purpose, we will make an impact that matters.  Learn from deep subject matter experts through mentoring and on the job coaching Be encouraged to deepen your technical skills...whatever those may be. Build your leadership skills at Deloitte University. What will your typical day look like? This role calls for a seasoned Cloud Security professional who not only possesses hands-on experience working with AWS, Azure, and GCP; but also demonstrates strong leadership capabilities. As a Senior Cloud Security Engineer, this role will require practical skills in deploying cloud security and developing governance strategies, with a focus on overseeing the security configurations of cloud services in AWS, Azure, and GCP. This role will involve leading and guiding the Security posture assessments of Cloud Services with the ultimate aim of providing comprehensive cloud security recommendations to application team stakeholders. Responsibilities:  Lead research, assessment, and analysis of security configurations of AWS, Azure, and GCP cloud services, including but not limited to Infrastructure-as-a-Service (IaaS), Platform-as-a-Service (PaaS), Software-as-a-Service (SaaS) and marketplace offerings. Deploy cloud services in sandbox environments and conduct security assessments to identify vulnerabilities. Assist team members with using tools and techniques to assess the security posture of the cloud service, identify any weaknesses or gaps, and recommend appropriate remediation actions to strengthen the security of the cloud infrastructure. Review Deloitte's internal information security standards and recommend security compliance guidance for cloud service security capabilities. Make recomendations to security standards as needed and collaborate with the development team to recommend development of new guardrails where necessary. Foster strong relationships with CSPs, marketplace vendors, and cross-functional teams. Additionally, work with architecture, application development, and security teams to ensure that the provided guidance is comprehensive and practical. Stay up-to-date with the latest trends and developments in cloud security and provide recommendations for enhancing security configurations based on emerging threats and vulnerabilities. Lead process improvement initiatives to develop a robust and efficient cloud services security assessment process. Mentor the cloud security team to foster a culture of continuous learning and improvement. About the team Deloitte Technology works at the forefront of technology development and processes to support and protect Deloitte around the world. In this truly global environment, we operate not in \"what is\" but rather \"what can be\" to help Deloitte deliver and connect with its clients, its communities, and one another in ways not previously conceived.Enough about us, let's talk about you  In this role, you bring:   A Bachelor's or Master's degree in Computer Science, Information Systems Security, or in a related field  7+ years of proven experience as Cloud Security Engineer or in a similar role, with at least 3 years in a leadership or management position   Proven, in-depth hands-on experience in all of AWS, Azure, and GCP platforms.   Extensive understanding and practical application of security frameworks, standards, and best practices (e.g., CIS Benchmarks, NIST 800-53, ISO 27001)   Excellent research and strategic thinking skills, with a strong attention to detail   Strong communication and interpersonal skills, with the ability to effectively communicate complex security concepts and recommendations to a variety of stakeholders, from technical experts to C-Suite leadership.   Proven ability to manage multiple tasks, lead and motivate a team, and thrive in a fast-paced & dynamic environment   Lifelong learning mindset, with a proven track record of staying on top of the latest trends and developments in cloud security and a passion for knowledge sharing and mentorship.    Certifications:    ISC2 CISSP (mandatory);CCSP (desired)   Solutions Architect in AWS, Azure or GCP   Security specialty in AWS, Azure or GCP    Desired:   Agile Framework experience Total RewardsThe salary range for this position is $85,000 - $156,000, and individuals may be eligible to participate in our bonus program. Deloitte is fair and competitive when it comes to the salaries of our people. We regularly benchmark across a variety of positions, industries, sectors, targets, and levels. Our approach is grounded on recognizing people's unique strengths and contributions and rewarding the value that they deliver.Our Total Rewards Package extends well beyond traditional compensation and benefit programs and is designed to recognize employee contributions, encourage personal wellness, and support firm growth. Along with a competitive base salary and variable pay opportunities, we offer a wide array of initiatives that differentiate us as a people-first organization. Some representative examples include: $4,000 per year for mental health support benefits, a $1,300 flexible benefit spending account, 38+ days off (including 10 firm-wide closures known as \"Deloitte Days\"), flexible work arrangements and a hybrid work structure.Our promise to our people: Deloitte is where potential comes to life.   Be yourself, and more. We are a group of talented people who want to learn, gain experience, and develop skills. Wherever you are in your career, we want you to advance. You shape how we make impact. Diverse perspectives and life experiences make us better. Whoever you are and wherever you're from, we want you to feel like you belong here. We provide flexible working options to support you and how you can contribute. Be the leader you want to be. Be the leader you want to be  Some guide teams, some change culture, some build essential expertise. We offer opportunities and experiences that support your continuing growth as a leader. Have as many careers as you want. We are uniquely able to offer you new challenges and roles - and prepare you for them. We bring together people with unique experiences and talents, and we are the place to develop a lasting network of friends, peers, and mentors. Our TVP is about relationships - between leaders and their people, the firm and its people, peers, and within in our communities.The next step is yours   At Deloitte, we are all about doing business inclusively - that starts with having diverse colleagues of all abilities. Deloitte encourages applications from all qualified candidates who represent the full diversity of communities across Canada. This includes, but is not limited to, people with disabilities, candidates from Indigenous communities, and candidates from the Black community in support of living our values, creating a culture of Diversity Equity and Inclusion and our commitment to our AccessAbility Action Plan , Reconciliation Action Plan and the BlackNorth Initiative .  We encourage you to connect with us at accessiblecareers@deloitte.ca if you require an accommodation for the recruitment process (including alternate formats of materials, accessible meeting rooms or other accommodations) or indigenouscareers@deloitte.ca for any questions relating to careers for Indigenous peoples at Deloitte (First Nations, Inuit, Métis). By applying to this job you will be assessed against the Deloitte Global Talent Standards. We've designed these standards to provide our clients with a consistent and exceptional Deloitte experience globally. Deloitte Canada has 30 offices with representation across most of the country. We acknowledge our offices reside on traditional, treaty and unceded territories as part of Turtle Island and is still home to many First Nations, Métis, and Inuit peoples. We are all Treaty people.Job Segment:  Cloud, Information Technology, IT Manager, Developer, Business Process, Technology, Management\n\n                    Category\n Management and Executive\n", "details": ["\n\n                                5 days ago\n                            ", " Full Time", " Management and Executive"]}, {"title": "Principal Embedded Software Developer", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionFortinet is currently seeking an experienced embedded software Developer for development of our next generation security solution impacting multiple products of the Fortinet Security Fabric with focus on FortiGate. FortiGate is our award winning flagship product, which consolidates security platforms while delivering unmatched performance and protection. The ideal candidate needs to have sound knowledge of system's development using C/C++, hands-on experience working in Linux/Unix environment and working knowledge of networking and application protocols (HTTP/S, TCP/IP). This is a great opportunity to grow as core member of the team responsible for driving the development of the next generation of Fortinet products. Job Responsibilities:   •Develop, design, and test the software for Fortinet products  •Maintain, evaluate, tune, and support the implementation of software and firmware products   •Hands-on bug fixes for the current Fortinet products   •Implement new features according to the new feature specifications and TOP3  •Research, investigate, and define new areas of technology to enhance existing FortiGate products or new product directions; re-evaluate the design and implementation of current source code  •Maintain and document code using source control system   •Instrumental in product road map realization  Job Skills Required:   •10+ years of experience in software development within Unix/Linux environment  •Stronghold of C and data structures required * Strong knowledge or experience with network, e.g. IP, TCP, DHCP, WCCP, DNS, routing protocols, etc.  •Sound knowledge of network concepts and architecture, e.g., IP, TCP, DHCP, WCCP, DNS, routing protocols, etc.   •Capable of switching focus in various situations and applying themselves to quickly learning new technologies and adopting new methodologies   •Excellent problem solving and troubleshooting skills   Education Requirements:    •Bachelor degree in Computer Science or similar degree  #GD #LI-MG1\n\n                    Category\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "Software QA - FortiOS", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionFortinet is looking for a Software Dev QA to join our UI (User interface) Development team to focus on GUI testing. As a team member, you will be responsible for testing the FortiOS GUI for managing FortiGate firewall appliances. You will be working closely with the interface development team to verify new features, automate test cases and improve the product's usability, reliability and performance.  This is an exciting opportunity to work with the latest in Web application and networking technologies such as Security Fabric, Next Generation Firewall, Unified Threat Management, Cloud Application control, VPN management, WiFi access point, and Firewall monitoring.   To find out more about what it is like working for the team, watch this video - https://www.youtube.com/watch?v=zx56_G2RnjE   Job Responsibilities:   •Execute feature and bug fix testing for FortiOS GUI application using a combination of manual and automated testing techniques.  •Automate front-end testing using Selenium (Java).  •Identify, document, and track software defects found during testing.  •Work closely with developers to ensure defects are correctly identified and fixed.  •Improve testing and development processes using various automation techniques.  Job Skills Required:   •Experience in software testing including Web application and REST API testing.  •Solid networking knowledge (IP stack, Routing, NAT, Firewall).  •Knowledge of general QA procedures and methodologies, as well as software development fundamentals.  •Demonstrated ability to logically and analytically troubleshoot Web application.  •Demonstrated ability to write clear and reproducible problem reports, and test results.  •Demonstrated skills in scripting languages such as Python is an asset.  •Experience with Selenium (Java) is an asset.  •Experience with code review systems and bug tracking services is an asset.  •Experience working in a Linux environment.  Educational Requirements:   •A degree or technical diploma in Computer Science, Computer Technology, or related field.  #GD #LI-CN1\n\n                    Category\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "Mobile Developer", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionFortinet has an exciting opportunity for a Mobile Developer capable of leading a team responsible for building the next generation of mobile firewall management software. Fortinet is looking for candidates with a strong mobile development background, leadership potential and a passion for creating user-friendly, powerful interfaces. You will work closely with the user interface, product management and other development teams responsible for our Fortigate product. To see an example of the work done by this team go to the Apple App Store and try out our FortiExplorer product!  To find out more about what it is like working for the team, watch this video - https://www.youtube.com/watch?v=zx56_G2RnjE  Job Responsibilities:   •Design and develop software for Fortinet mobile applications  •Troubleshoot, identify and improve product quality following QA testing and customer feedback  •Maintain, improve and support existing software products  •Collaborate with other teams to integrate product functionality  Job Skills Required:   •Software development experience in an Android or iOS environment  •Proven track record of designing and building applications for Android and/or iOS  •Hands-on experience with Kotlin/Java or Swift  •Flutter/Dart experience is an asset  •Experience with Git or Subversion and continuous integration is a plus  •Experience with TCP/IP networking and network security  •Experience with Unit testing/TDD  #GD #LI-CN1\n\n                    Category\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "Technical Security Architect - Senior Consultant/Manager", "company": "Deloitte", "date": "Mar. 30, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\nJob Type:Permanent Reference code:125936 Primary Location:Toronto, Ontario, Canada All Available Locations:Toronto, ON  Our Purpose  At Deloitte, we are driven to inspire and help our people, organization, communities, and country to thrive. Our Purpose is to build a better future by accelerating and expanding access to knowledge. Purpose defines who we are and gives us reason to exist as an organization.Have many careers in one Firm. Partner with clients to solve their most complex problems Be expected to share your ideas and to make them a reality.In a rapidly changing world where information has a significant value, supply chains are interconnected and there is uncertainty when doing business on a global basis, information security and privacy have become board level issues.What will your typical day look like? In your role as a Solution Architect, you will be responsible for envisioning and developing new digital products. You will execute day-to-day product development activities across design, development, stakeholder communication, technology vendor management and delivery.  Responsibilities: • Lead clients, complex projects, drive business requirement gathering, manage scope and client expectations. • Design long-term, reliable, and end-to-end technical architectures. Develop functional architecture design and contribute to product vision. • Transforms detailed requirements into a complete, detailed systems design document. • Supports creation of interface specifications and call flows for the various components in the design • Provide inputs to create Agile user stories based on marketing business requirements. • Provide technical support for analysis of business requirements and applicability to the current or planned Platform/Enabler/API Platform capabilities. • Participate in end-to-end functionality assessment during solution testing phases. • Serve as a technical liaison between the business, project team and developers/testers. • Collaborate with IT infrastructure teams (DevOps, Cyber, networking) to deploy and maintain applications. • About the team • Deloitte Technology Services works at the forefront of technology development and processes to support and protect Deloitte around the world. In this truly global environment, we operate not in \"what is\" but rather \"what can be\" to help Deloitte deliver and connect with its clients, its communities, and one another in ways not previously conceived.About the team Deloitte's Cyber Risk Services helps our clients to be Secure, Vigilant and Resilient in the face of an ever increasing array of cyber threats and vulnerabilities. Our Cyber Risk practice helps organizations with the management of information and technology risks by delivering end-to-end solutions, using proven methodologies and tools. Our services help organizations address timely and pervasive issues such as identity theft, data security breaches, data leakage, cybersecurity, and system outages across organizations of various sizes and industries, with the goal of enabling ongoing, secure, and reliable operations across the enterprise. The environment at Deloitte is made up of intellectually curious, smart people; including world class security and privacy experts. Your mix of work will help foster your leadership skills and you will develop relationships with a team that you respect and have fun with. In addition, you will have the opportunity to identify areas of work that are of particular interest to you.Enough about us, let's talk about you You bring:  • Minimum of 10+ years of industry related experience (financial services, government or banking) • Minimum of 7+ years in an architect capacity • Minimum of 5+ years of experience in leading architecture activities like designing, roadmap, & proof-of-concepts. • Prior experience in native application architecture and deployment in Microsoft Azure • Proven ability to lead multiple customers, complex projects, and multiple initiatives. • Prior hands-on experience in web-based technologies including Microsoft .Net, ASP.NET Web API and complementary business layer and front-end technologies like AngularJs, ReactJs, NodeJS, etc., • Prior hands-on experience with Microsoft SQL Server, MongoDB, Cosmos DB, Oracle etc., • A Bachelor's degree or equivalent in Computer Science, Business Administration, or related discipline. While an advanced degree is preferred, the value is placed on the extent of the relevant experience and accomplishments. • Ability to travel and / or work from a Deloitte office 10-15% of time.  Preferred:  • Microsoft Azure certifications (AZ300 through and including Azure 305) • Experience working with SAFe or Agile development processes. • Exposure to Cloud Cognitive Services and AI platforms • TOGAF or SEI - Software Architecture Certification etc., • Familiarity with PowerBI or similar enterprise-class reporting / analytics toolsTotal RewardsThe salary range for this position is $83,000 - $173,000, and individuals may be eligible to participate in our bonus program. Deloitte is fair and competitive when it comes to the salaries of our people. We regularly benchmark across a variety of positions, industries, sectors, targets, and levels. Our approach is grounded on recognizing people's unique strengths and contributions and rewarding the value that they deliver.Our Total Rewards Package extends well beyond traditional compensation and benefit programs and is designed to recognize employee contributions, encourage personal wellness, and support firm growth. Along with a competitive base salary and variable pay opportunities, we offer a wide array of initiatives that differentiate us as a people-first organization. Some representative examples include: $4,000 per year for mental health support benefits, a $1,300 flexible benefit spending account, 38+ days off (including 10 firm-wide closures known as \"Deloitte Days\"), flexible work arrangements and a hybrid work structure.Our shared values  While our Purpose guides us and helps explain why we exist, our shared values describe the behaviour we expect from each other at the firm. They provide common ground to unite us across cultures and geographies. They help us to earn the trust and respect of our stakeholders. We all commit to living by these shared values, to stay true to the principles they represent, and to honour the legacy from which they came. They are what sets us apart and makes us Deloitte. Every day, we live our Purpose through the following five shared values:  Lead the way: Deloitte is not only leading the profession, but reinventing it for the future. We're also committed to creating opportunity and leading the way to a more sustainable world.  Serve with integrity: Deloitte has earned the trust of employees, clients, regulators, and the public for 175 years. Upholding that trust is our single most important responsibility.  Take care of each other: We look out for one another and prioritize respect, fairness, development, and well-being.  Foster inclusion: We are at our best when we foster an inclusive culture and embrace diversity in all forms. We know this attracts top talent, enables innovation, and helps us deliver well-rounded client solutions.  Collaborate for measurable impact: We approach our work with a collaborative mindset, teaming across businesses, geographies, and skill sets to deliver tangible, measurable, attributable impact. The next step is yours   Sound like The One Firm. For You?  At Deloitte, we are all about doing business inclusively - that starts with having diverse colleagues of all abilities. Deloitte encourages applications from all qualified candidates who represent the full diversity of communities across Canada. This includes, but is not limited to, people with disabilities, candidates from Indigenous communities, and candidates from the Black community in support of living our values, creating a culture of Diversity Equity and Inclusion and our commitment to our AccessAbility Action Plan , Reconciliation Action Plan and the BlackNorth Initiative .  We encourage you to connect with us at accessiblecareers@deloitte.ca if you require an accommodation for the recruitment process (including alternate formats of materials, accessible meeting rooms or other accommodations). We'd love to hear from you! By applying to this job you will be assessed against the Deloitte Global Talent Standards. We've designed these standards to provide our clients with a consistent and exceptional Deloitte experience globally. Deloitte Canada has 30 offices with representation across most of the country. We acknowledge our offices reside on traditional, treaty and unceded territories as part of Turtle Island and is still home to many First Nations, Métis, and Inuit peoples. We are all Treaty people.Job Segment:  Developer, Information Technology, IT Manager, Architecture, Computer Science, Technology, Engineering\n\n                    Category\n Management and Executive\n", "details": ["\n\n                                21 hours ago\n                            ", " Full Time", " Management and Executive"]}, {"title": "Principal Embedded Software Developer", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionFortinet is currently seeking an experienced embedded software Developer for development of our next generation security solution impacting multiple products of the Fortinet Security Fabric with focus on FortiGate. FortiGate is our award winning flagship product, which consolidates security platforms while delivering unmatched performance and protection. The ideal candidate needs to have sound knowledge of system's development using C/C++, hands-on experience working in Linux/Unix environment and working knowledge of networking and application protocols (HTTP/S, TCP/IP). This is a great opportunity to grow as core member of the team responsible for driving the development of the next generation of Fortinet products. Job Responsibilities:   •Develop, design, and test the software for Fortinet products  •Maintain, evaluate, tune, and support the implementation of software and firmware products   •Hands-on bug fixes for the current Fortinet products   •Implement new features according to the new feature specifications and TOP3  •Research, investigate, and define new areas of technology to enhance existing FortiGate products or new product directions; re-evaluate the design and implementation of current source code  •Maintain and document code using source control system   •Instrumental in product road map realization  Job Skills Required:   •10+ years of experience in software development within Unix/Linux environment  •Stronghold of C and data structures required * Strong knowledge or experience with network, e.g. IP, TCP, DHCP, WCCP, DNS, routing protocols, etc.  •Sound knowledge of network concepts and architecture, e.g., IP, TCP, DHCP, WCCP, DNS, routing protocols, etc.   •Capable of switching focus in various situations and applying themselves to quickly learning new technologies and adopting new methodologies   •Excellent problem solving and troubleshooting skills   Education Requirements:    •Bachelor degree in Computer Science or similar degree  #GD #LI-MG1\n\n                    Category\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "Software Developer", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionFortinet team has a great career opportunity for a Software Developer within its FortiClient EMS team. Our ideal candidate should be experienced, eager to learn and passionate about developing and designing high performance and scalable solutions.   FortiClient's Security Fabric Integration provides endpoint visibility through telemetry and ensures that all fabric components - FortiGate, FortiAnalyzer, EMS, Managed AP, Managed Switches, and Sandbox - have a unified view of endpoints in order to provide tracking and awareness, compliance enforcement, and reporting. Fortinet extends ZTNA control to end-user devices both on- and off-network operation through FortiClient. Easy to use Secure Remote Access and Mobility via SSL and IPsec VPN. FortiClient connects every endpoint to form a cohesive security fabric.    Job Responsibilities:     • Design, Implementation and maintenance of the FortiClient EMS services (server side)     Skills Required:     • Experience writing scalable software.   • Experience working with containers (Docker, KVM or related technologies).   • Experience with NoSQL databases.   • Experience in multi-threaded, high performance server side code designs.   • Experience in network programming.   • Experience in relational databases, such as MS SQL, MySQL, PostgreSQL.   • Some experience with C/C++ programming in Microsoft Windows and Linux development environments.   • Excellent problem solving and troubleshooting skills.   • Must be able to work well in a team development environment.   • Experience in the following is a plus: C#, GoLang, Python.     Educational Requirements:     • Degree, diploma or masters in Computer Science or Software Engineering disciplines or relevant years of related experience in similar domain   • Minimum 5+ years in software development   #GD #LI-AV1\n\n                    Category\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "Senior Manager SSDLC Operations Leader, Deloitte Global Technology", "company": "Deloitte", "date": "Mar. 26, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\nJob Type:Permanent Reference code:125975 Primary Location:Toronto, ON All Available Locations:Ottawa, ON  Our Purpose   At Deloitte, we are driven to inspire and help our people, organization, communities, and country to thrive. Our Purpose is to build a better future by accelerating and expanding access to knowledge. Purpose defines who we are and gives us reason to exist as an organization. By living our Purpose, we will make an impact that matters.  Enjoy flexible, proactive, and practical benefits that foster a culture of well-being and connectedness. Experience a firm where wellness matters. Be expected to share your ideas and to make them a reality. Deloitte Global is the engine of the Deloitte network. Our professionals reach across disciplines and borders to develop and lead global initiatives. We deliver strategic programs and services that unite our organization.What will your typical day look like?In this role you will have leadership position within a new Business Information Security function, positioned to lead a team that provides cybersecurity support/guidance for a diverse portfolio of Technology system/solutions used across Deloitte.    Primary Responsibilities:    Collaborate with senior business and technology leaders, supporting them in designing and building solutions that adhere to the firm's (current and future) security design requirements, helping them in achieving their associated objectives and overall strategy and not being afraid to challenge decisions that may place the firm at risk.   Ensure effective and on-time delivery of security guidance for complex technology systems and solutions within Deloitte Technology, completion of cyber reviews for applications migrating from on-prem data centers to public and private cloud environments.   Build strong working relationships across the Global Cybersecurity organization, Shared Services Organization, SSDLC Optimization Team, and peers from member firm cyber teams.   Represent Global Cybersecurity on the Global Architectural Review Board   Ensure continued compliance with SSDLC requirements as defined by Deloitte and industry cyber frameworks (e.g., ISO 27001)   Lead the evolution, development, and implementation of reporting metrics, demonstrating Cybersecurity value and risk reduction across your assigned technology customer area.   Contribute to the ongoing evolution of the Business Information Security team.  About the teamDeloitte Technology works at the forefront of technology development and processes to support and protect Deloitte around the world. In this truly global environment, we operate not in \"what is\" but rather \"what can be\" to help Deloitte deliver and connect with its clients, its communities, and one another in ways not previously conceived.Enough about us, let's talk about you At least 10 years combined experience in cybersecurity working in an information security context At least 5 years holding a leadership or senior management role Ability to define strategy and influence senior stakeholders High degree of business acumen, understanding complex business needs and the value of secure design principles (SSDLC) and other cyber capabilities deliver in reducing cyber risk across Deloitte Excellent interpersonal and collaborative skills, with ability to communicate strategic information, security topics, policies, and standards as well as risk-related concepts to technical and non-technical audiences at various levels Lead a global team of diverse, experienced cyber professionals in a fast-paced environment Demonstrated knowledge of securing applications, large enterprise platforms and infrastructure systems (secure coding methods, WAF, application gateways, firewalls, servers, virtualized technologies) Securing cloud-based environments and understanding risks associated with cloud-based solutions hosted in M365, Azure, AWS and GCP Understanding of containerization technologies such as Kubernetes and Docker Understanding of DevSecOps and agile methodologies Understanding of applying secure system/solution design principles to prevent application specific security defects based on OWASP Top 10 vulnerabilities Understanding of identity management and federation technologies and concepts Knowledge of software development models (e.g., Waterfall Model, Agile) Knowledge of common information security management frameworks, such as ISO/IEC 27001, COBIT, and NIST, including 800-53 and the NIST Cybersecurity Framework   Education:  Bachelor's degree in computer science, cybersecurity, other technology-related fields, or equivalent work- related experience in a similar role within a large multi-national organization considered   Preferred:  At least 10 years combined experience in cybersecurity and / or solution design in an information security context Professional security certification desirable, such as Certified Information Systems Security Professional (CISSP), Certified Information Systems Auditor (CISA), Certified Information Security Manager (CISM), Certified Cloud Security Professional (CCSP), or other similar credentials Total RewardsThe salary range for this position is $104,000 - $215,000, and individuals may be eligible to participate in our bonus program. Deloitte is fair and competitive when it comes to the salaries of our people. We regularly benchmark across a variety of positions, industries, sectors, targets, and levels. Our approach is grounded on recognizing people's unique strengths and contributions and rewarding the value that they deliver.Our Total Rewards Package extends well beyond traditional compensation and benefit programs and is designed to recognize employee contributions, encourage personal wellness, and support firm growth. Along with a competitive base salary and variable pay opportunities, we offer a wide array of initiatives that differentiate us as a people-first organization. Some representative examples include: $4,000 per year for mental health support benefits, a $1,300 flexible benefit spending account, 38+ days off (including 10 firm-wide closures known as \"Deloitte Days\"), flexible work arrangements and a hybrid work structure.Our promise to our people: Deloitte is where potential comes to life.   Be yourself, and more. We are a group of talented people who want to learn, gain experience, and develop skills. Wherever you are in your career, we want you to advance. You shape how we make impact. Diverse perspectives and life experiences make us better. Whoever you are and wherever you're from, we want you to feel like you belong here. We provide flexible working options to support you and how you can contribute. Be the leader you want to be. Be the leader you want to be  Some guide teams, some change culture, some build essential expertise. We offer opportunities and experiences that support your continuing growth as a leader. Have as many careers as you want. We are uniquely able to offer you new challenges and roles - and prepare you for them. We bring together people with unique experiences and talents, and we are the place to develop a lasting network of friends, peers, and mentors. Our TVP is about relationships - between leaders and their people, the firm and its people, peers, and within in our communities.The next step is yours   At Deloitte, we are all about doing business inclusively - that starts with having diverse colleagues of all abilities. Deloitte encourages applications from all qualified candidates who represent the full diversity of communities across Canada. This includes, but is not limited to, people with disabilities, candidates from Indigenous communities, and candidates from the Black community in support of living our values, creating a culture of Diversity Equity and Inclusion and our commitment to our AccessAbility Action Plan , Reconciliation Action Plan and the BlackNorth Initiative .  We encourage you to connect with us at accessiblecareers@deloitte.ca if you require an accommodation for the recruitment process (including alternate formats of materials, accessible meeting rooms or other accommodations) or indigenouscareers@deloitte.ca for any questions relating to careers for Indigenous peoples at Deloitte (First Nations, Inuit, Métis). By applying to this job you will be assessed against the Deloitte Global Talent Standards. We've designed these standards to provide our clients with a consistent and exceptional Deloitte experience globally. Deloitte Canada has 30 offices with representation across most of the country. We acknowledge our offices reside on traditional, treaty and unceded territories as part of Turtle Island and is still home to many First Nations, Métis, and Inuit peoples. We are all Treaty people.Job Segment:  Cyber Security, Cloud, Operations Manager, Developer, Information Security, Security, Technology, Operations\n\n                    Category\n Management and Executive\n", "details": ["\n\n                                4 days ago\n                            ", " Full Time", " Management and Executive"]}, {"title": "Senior Mobile Developer", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionFortinet has an exciting opportunity for a Senior Mobile Developer capable of leading a team responsible for building the next generation of mobile firewall management software. Fortinet is looking for candidates with a strong mobile development background, leadership potential and a passion for creating user-friendly, powerful interfaces. You will work closely with the user interface, product management and other development teams responsible for our Fortigate product. To see an example of the work done by this team go to the Apple App Store and try out our FortiExplorer product! To find out more about what it is like working for the team, watch this video - https://www.youtube.com/watch?v=zx56_G2RnjE  Job Responsibilities:   •Design and develop software for Fortinet mobile applications  •Troubleshoot, identify and improve product quality following QA testing and customer feedback  •Maintain, improve and support existing software products  •Collaborate with other teams to integrate product functionality  Job Skills Required:   •Software development experience in an Android or iOS environment  •Proven track record of designing and building applications for Android and/or iOS  •Hands-on experience with Kotlin/Java or Swift  •Flutter/Dart experience is an asset  •Experience with Git or Subversion and continuous integration is a plus  •Experience with TCP/IP networking and network security  •Experience with Unit testing/TDD  #GD #LI-CN1Fortinet (NASDAQ: FTNT) secures the largest enterprise, service provider, and government organizations around the world. Fortinet empowers its customers with intelligent, seamless protection across the expanding attack surface and the power to take on ever-increasing performance requirements of the borderless network - today and into the future. Only the Fortinet Security Fabric architecture can deliver security features without compromise to address the most critical security challenges, whether in networked, application, cloud or mobile environments. Fortinet ranks number one in the most security appliances shipped worldwide and more than 450,000 customers trust Fortinet to protect their businesses. \nCategory\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "Senior Full-Stack Web Developer", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionFortinet team has a great career opportunity for a Senior Full-Stack Web Developer within its FortiClient team, which is responsible for several of Fortinet's client software developments. The new developer will be primarily working on the FortiClient EMS software with an emphasis on both front-end and back-end web development.    Job Responsibilities:     • Design, research, development and maintenance for the FortiClient EMS software   • Stay on top of new developments in the fields of front-end and back-end web application development     Skills Required:     • Experience with web application development   • Experience with building user interfaces using modern web standards   • Familiar with JavaScript frameworks (ex. Vue.js, AngularJS, React).   • Experience with web frameworks (ex. Django, Flask, Express.js)   • Experience with relational databases (ex. MS SQL, PostgreSQL)   • Familiar with RESTful API design principles   • Experience designing and implementing large development projects   • Experience mentoring junior developers   • Excellent problem solving and troubleshooting skills   • Must be able to work well in a team development environment     Nice-to-Have:     • Experience with NoSQL databases (ex. MongoDB, Elasticsearch)   • Experience with data visualization front-end libraries (ex. D3.js)   • Experience with Python, Go   • Experience with microservices architecture   • Experience with network topology and security    #GD   #LI-AV1\n\n                    Category\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "Technical Writer", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionFortinet is looking for an intermediate Technical Communicator to join our team in Burnaby. The successful candidate will create technical articles, documentation and user-facing materials to enhance knowledge transfer of new products, software releases and use cases. Technical documentation is published to the Docs Library at https://docs.fortinet.com/   You must have outstanding English language skills, a curiosity for technology, a passion for creating useful technical content, and an interest in single-sourcing content. You must also possess the ability to document features by reading specifications, talking to subject matter experts, and using the software.   The successful candidate will work closely with Product Managers, Developers, QA, and others to understand new features, use cases, and customer scenarios in order to:    • Write and publish user guides, reference materials, and use-case scenarios for new product releases   • Write conceptual and procedural content   • Use images to supplement descriptive content, and deliver a user experience aligned with how customers want to consume the content    Requirements:    • Experience working in software development environments   • Ability to convert complex technical information into clean, concise, and coherent end-user documentation in plain English   • Strong command of standard American English grammar and usage   • Experience using some or all of the following software: MadCap Flare, Adobe InDesign, and Adobe Illustrator   • BA or BS degree, preferably in computer science, computer engineering, electrical engineering, MIS, English, or a related field    #LI-CN1   #GD\n\n                    Category\n Maintenance and Technicians\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Maintenance and Technicians"]}, {"title": "Software Architect", "company": "Emonster Solutions", "date": "Mar. 6, 2024", "location": "<br/>\nRichmond, BC<br/>\n</div>", "descrip": "\nAbout UsAt Emonster Solutions, we're more than just a digital agency—we're your partners in innovation and growth. With a proven track record for almost a decade, we specialize in crafting digital solutions that elevate businesses to new heights. As a Google Partner and Semrush agency partner, our team brings unparalleled expertise in leveraging cutting-edge technology and insights to drive success in the dynamic digital landscape. From creating stunning websites that encapsulate your brand identity to optimizing SEO strategies for maximum visibility, we're dedicated to delivering exceptional results that exceed expectations. Our commitment to excellence, coupled with a passion for innovation, ensures that every project we undertake is tailored to meet your unique needs and objectives. At Emonster Solutions, we're here to transform your vision into reality and propel your business towards sustained success.\n \nWe are now looking for a Software Architect to join our team. Please send your resume to hr2@emonster.ca. Only selected applicants will be interviewed and we thank you for your interest.\n \nPosition Detail\nEmployment Type: Full-time, Permanent\nHourly Rate: $55.00\nWeekly Hours: 35 to 40\nWork Location: Richmond, BC\nWebsite: https://emonster.ca/ \n \nDuties and Responsibilities\n-Design software solutions that meet the specific needs and requirements of clients, ensuring they align with their business goals and objectives.\n-Collaborate with project managers and development teams to define technical requirements, timelines, and priorities for each project.\n-Evaluate and select appropriate technologies and frameworks for software development, considering factors such as scalability, security, and performance.\n-Create comprehensive system architectures that integrate various components seamlessly, providing a blueprint for the development process.\n-Conduct regular code reviews and architectural reviews to ensure adherence to coding standards and best practices, maintaining high-quality deliverables.\n-Optimize software performance by identifying and addressing bottlenecks, implementing solutions for speed, efficiency, and resource utilization.\n-Assess potential risks and vulnerabilities in software architectures, implementing strategies to mitigate security threats and ensure data protection.\n-Provide technical guidance and mentorship to development teams, fostering skill development and knowledge sharing across projects.\n-Stay informed about emerging technologies, trends, and best practices in software development, advocating for their adoption to improve efficiency and productivity.\n \n \nQualifications\n-A bachelor’s degree in Computer Science or a related discipline.\n-2 to 3 years of related experience is an asset.\n-Proficiency in various design patterns with a good understanding of applications in designing scalable and maintainable software architectures is a plus.\n-Demonstrated experience with cloud platforms such as AWS, Azure, or Google Cloud, including expertise in architecting and deploying cloud-native applications is highly preferred.\n-Proficiency in programming languages such as Java, Python, or JavaScript, along with experience in frameworks enabling effective communication and collaboration with development teams is an asset.\n \nCategory\n Information Technology\n", "details": ["\n\n                                24 days ago\n                            ", "\n\n                                    55 per hour\n                                ", " Richmond, BC", " Full Time", " Information Technology"]}, {"title": "Release QA Specialist", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionOur Release QA team in Burnaby has over 130 staff and are responsible for ensuring Fortinet products meet the high standards we expect before release to the market. We are currently recruiting for teams focused on QA activities for our FortiOS, FortiManager, FortiAnalyzer and FortiClient products. Technical Job Duties:   •Execute regression testing on products using a combination of manual and auto testing techniques. Create, maintain, and execute test specifications and test cases  •Write and maintain automation scripts  •Identify, document, and track software defects found during testing  •Work closely with developers to ensure defects are correctly identified and fixed  Writing Job Duties:   •Work closely with Developers, QA, Product Managers, and others to understand new features, use cases, and customer scenarios.  •Document & publish release notes, user guides, reference materials and use case scenarios for new product releases.  Job Experience Required:   •3 - 5 years of software testing experience.  •Solid understanding of TCP/IP, routing, DNS, DHCP, routing and switching  •Working experience on Virtual machine environment, i.e VMware / ESXi, Hypervisor  •Demonstrated knowledge of firewalls, Linux, Sniff, or Ethereal  •Strong knowledge of IPSec, SSL VPN, data encryption and authentication  •Knowledge of general QA procedures and methodologies, as well as software development fundamentals  •Experience configuring, installing, and troubleshooting PC/server software and hardware in a Windows and Unix environment  •Demonstrated ability to logically and analytically troubleshoot software  •Ability to work in a collaborative environment and communicate well with other departments  •Ability to work on assigned tasks under tight time constraints  •Demonstrated ability to write clear and reproducible problem reports, and test results  •Demonstrated skills in scripting languages, such as shell, TCL, PERL or Python are considered assets  •Demonstrated writing skills.  •Knowledge of database is considered an asset  •Knowledge of JSON API is considered an asset  Educational Requirement:   •A degree or technical diploma in Computer Science, Computer Technology, or related field  #LI-HP1 #GD\n\n                    Category\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "Senior Manager SSDLC Operations Leader, Deloitte Global Technology", "company": "Deloitte", "date": "Mar. 26, 2024", "location": "<br/>\nCanada, <br/>\n</div>", "descrip": "\nJob Type:Permanent Reference code:125975 Primary Location:Toronto, ON All Available Locations:Ottawa, ON  Our Purpose   At Deloitte, we are driven to inspire and help our people, organization, communities, and country to thrive. Our Purpose is to build a better future by accelerating and expanding access to knowledge. Purpose defines who we are and gives us reason to exist as an organization. By living our Purpose, we will make an impact that matters.  Enjoy flexible, proactive, and practical benefits that foster a culture of well-being and connectedness. Experience a firm where wellness matters. Be expected to share your ideas and to make them a reality. Deloitte Global is the engine of the Deloitte network. Our professionals reach across disciplines and borders to develop and lead global initiatives. We deliver strategic programs and services that unite our organization.What will your typical day look like?In this role you will have leadership position within a new Business Information Security function, positioned to lead a team that provides cybersecurity support/guidance for a diverse portfolio of Technology system/solutions used across Deloitte.    Primary Responsibilities:    Collaborate with senior business and technology leaders, supporting them in designing and building solutions that adhere to the firm's (current and future) security design requirements, helping them in achieving their associated objectives and overall strategy and not being afraid to challenge decisions that may place the firm at risk.   Ensure effective and on-time delivery of security guidance for complex technology systems and solutions within Deloitte Technology, completion of cyber reviews for applications migrating from on-prem data centers to public and private cloud environments.   Build strong working relationships across the Global Cybersecurity organization, Shared Services Organization, SSDLC Optimization Team, and peers from member firm cyber teams.   Represent Global Cybersecurity on the Global Architectural Review Board   Ensure continued compliance with SSDLC requirements as defined by Deloitte and industry cyber frameworks (e.g., ISO 27001)   Lead the evolution, development, and implementation of reporting metrics, demonstrating Cybersecurity value and risk reduction across your assigned technology customer area.   Contribute to the ongoing evolution of the Business Information Security team.  About the teamDeloitte Technology works at the forefront of technology development and processes to support and protect Deloitte around the world. In this truly global environment, we operate not in \"what is\" but rather \"what can be\" to help Deloitte deliver and connect with its clients, its communities, and one another in ways not previously conceived.Enough about us, let's talk about you At least 10 years combined experience in cybersecurity working in an information security context At least 5 years holding a leadership or senior management role Ability to define strategy and influence senior stakeholders High degree of business acumen, understanding complex business needs and the value of secure design principles (SSDLC) and other cyber capabilities deliver in reducing cyber risk across Deloitte Excellent interpersonal and collaborative skills, with ability to communicate strategic information, security topics, policies, and standards as well as risk-related concepts to technical and non-technical audiences at various levels Lead a global team of diverse, experienced cyber professionals in a fast-paced environment Demonstrated knowledge of securing applications, large enterprise platforms and infrastructure systems (secure coding methods, WAF, application gateways, firewalls, servers, virtualized technologies) Securing cloud-based environments and understanding risks associated with cloud-based solutions hosted in M365, Azure, AWS and GCP Understanding of containerization technologies such as Kubernetes and Docker Understanding of DevSecOps and agile methodologies Understanding of applying secure system/solution design principles to prevent application specific security defects based on OWASP Top 10 vulnerabilities Understanding of identity management and federation technologies and concepts Knowledge of software development models (e.g., Waterfall Model, Agile) Knowledge of common information security management frameworks, such as ISO/IEC 27001, COBIT, and NIST, including 800-53 and the NIST Cybersecurity Framework   Education:  Bachelor's degree in computer science, cybersecurity, other technology-related fields, or equivalent work- related experience in a similar role within a large multi-national organization considered   Preferred:  At least 10 years combined experience in cybersecurity and / or solution design in an information security context Professional security certification desirable, such as Certified Information Systems Security Professional (CISSP), Certified Information Systems Auditor (CISA), Certified Information Security Manager (CISM), Certified Cloud Security Professional (CCSP), or other similar credentials Total RewardsThe salary range for this position is $104,000 - $215,000, and individuals may be eligible to participate in our bonus program. Deloitte is fair and competitive when it comes to the salaries of our people. We regularly benchmark across a variety of positions, industries, sectors, targets, and levels. Our approach is grounded on recognizing people's unique strengths and contributions and rewarding the value that they deliver.Our Total Rewards Package extends well beyond traditional compensation and benefit programs and is designed to recognize employee contributions, encourage personal wellness, and support firm growth. Along with a competitive base salary and variable pay opportunities, we offer a wide array of initiatives that differentiate us as a people-first organization. Some representative examples include: $4,000 per year for mental health support benefits, a $1,300 flexible benefit spending account, 38+ days off (including 10 firm-wide closures known as \"Deloitte Days\"), flexible work arrangements and a hybrid work structure.Our promise to our people: Deloitte is where potential comes to life.   Be yourself, and more. We are a group of talented people who want to learn, gain experience, and develop skills. Wherever you are in your career, we want you to advance. You shape how we make impact. Diverse perspectives and life experiences make us better. Whoever you are and wherever you're from, we want you to feel like you belong here. We provide flexible working options to support you and how you can contribute. Be the leader you want to be. Be the leader you want to be  Some guide teams, some change culture, some build essential expertise. We offer opportunities and experiences that support your continuing growth as a leader. Have as many careers as you want. We are uniquely able to offer you new challenges and roles - and prepare you for them. We bring together people with unique experiences and talents, and we are the place to develop a lasting network of friends, peers, and mentors. Our TVP is about relationships - between leaders and their people, the firm and its people, peers, and within in our communities.The next step is yours   At Deloitte, we are all about doing business inclusively - that starts with having diverse colleagues of all abilities. Deloitte encourages applications from all qualified candidates who represent the full diversity of communities across Canada. This includes, but is not limited to, people with disabilities, candidates from Indigenous communities, and candidates from the Black community in support of living our values, creating a culture of Diversity Equity and Inclusion and our commitment to our AccessAbility Action Plan , Reconciliation Action Plan and the BlackNorth Initiative .  We encourage you to connect with us at accessiblecareers@deloitte.ca if you require an accommodation for the recruitment process (including alternate formats of materials, accessible meeting rooms or other accommodations) or indigenouscareers@deloitte.ca for any questions relating to careers for Indigenous peoples at Deloitte (First Nations, Inuit, Métis). By applying to this job you will be assessed against the Deloitte Global Talent Standards. We've designed these standards to provide our clients with a consistent and exceptional Deloitte experience globally. Deloitte Canada has 30 offices with representation across most of the country. We acknowledge our offices reside on traditional, treaty and unceded territories as part of Turtle Island and is still home to many First Nations, Métis, and Inuit peoples. We are all Treaty people.Job Segment:  Cyber Security, Cloud, Operations Manager, Developer, Information Security, Security, Technology, Operations\n\n                    Category\n Management and Executive\n", "details": ["\n\n                                4 days ago\n                            ", " Full Time", " Management and Executive"]}, {"title": "Software Developer (C/C++)", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionFortinet has a great career opportunity for a Software Developer within its FortiClient team, which is responsible for one of the fastest-growing products in the company.   FortiClient's Security Fabric Integration provides endpoint visibility through telemetry and ensures that all fabric components - FortiGate, FortiAnalyzer, EMS, Managed AP, Managed Switches, and Sandbox - have a unified view of endpoints in order to provide tracking and awareness, compliance enforcement, and reporting. Fortinet extends ZTNA control to end-user devices both on- and off-network operation through FortiClient. Easy to use Secure Remote Access and Mobility via SSL and IPsec VPN. FortiClient connects every endpoint to form a cohesive security fabric.   The new developer will be primarily working on the FortiClient software. The basic requirement is having some OOP programming knowledge. Our ideal candidate will be smart/eager to learn. We are considering junior/new graduates for this role but also open to a strong candidate at the intermediate or senior level.    Must have skills:     • Experience with C/C++ and software development methodology   • Strong problem solving and analytical skills     Desired skills:     • Experience with operating system interfaces for threads, process control, and virtual memory   • Experience with either Linux, Mac or Windows platforms   • Experience writing and debugging network programs   • Experience writing and debugging multithreaded programs   • Experience with scripting languages (Python, Shell etc) is a plus   • Experience with Docker, Golang is a plus   • Experience with Go and software development methodology.   • Knowledge of media encoding and transcoding, packaging, and familiarity with realtime video streaming.   • Knowledge of VPN and network topology   • Knowledge of networking and cloud infrastructure (HTTP 1.0/2.0, Concurrency Framework) along with troubleshooting skills using network analysis tools.   • Experience with FFMPEG and/or other encoding/packaging open source tools     Educational qualifications:     • BS or MS degree in Computer Science, Electrical Engineering or related field   #GD #LI-AV1\n\n                    Category\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "Quality Analyst", "company": "Ledcor", "date": "Mar. 24, 2024", "location": "<br/>\nVancouver, BC<br/>\n</div>", "descrip": "\nJob Summary: You are a collaborative, communicative and process-management oriented individual responsible for the quality assurance and quality control Ledcor's software development efforts. In this role, you will be focused on supporting the accurate delivery of software to internal customers by asking key questions, verifying, documenting, reporting and re-validating. Your investigative mindset and critical thinking skills help the wider Ledcor community excel at their business. You will also provide Tier 1/2 support to end-users in addition to triaging and supporting the regular incident and issue tickets submitted. As part of this team, you will have the opportunity to work on waterfall, agile, and waterfall-agile hybrid projects.Come join Ledcor's Information Services team today!Essential ResponsibilitiesTests, analyzes, and assesses developed functionality, and contributes to refining backlog items while working alongside the development team and end-users.Performs functional, system, integration, regression, end-to-end, user acceptance testing.Prepares test data and test environment configuration. Performs test planning collaboration, test script creation, deficiency documentation, and gap identification.  Provides Tier 1/2 support for end users, escalates as necessary.Triages incoming demands and issues, towards work pipeline flow.Identifies opportunities for continuous improvement towards team overall success.Documents processes, procedures, and functionality of solutions and configurations for end-user training and education.QualificationsCollege, Trade or Technical Diploma in Computer Science, Software Engineering, UI / UX, Software Testing or related field. Bachelor's Degree preferred.2+ years experience in software development or related technology industries2+ years of experience in a customer facing, technical roleBeginner or intermediate level experience with testing and testing methodologiesHands on experience with MS SQLHands on experience with HTML, CSS, JavaScript, JSON & XMLSome test automation experience preferredAdditional Information: Company DescriptionThe Ledcor Group of Companies is one of North America's most diversified construction companies. Ledcor is a company built on a rich history of long-standing project successes. But when you work for Ledcor, your experience will go far beyond the project. Do you want a career that means more? Join our True Blue team now!Employment EquityAt Ledcor we believe diversity, equity, and inclusion should be part of everything we do. We are proud to be an equal-opportunity employer. All qualified individuals, regardless of race, color, religion, sex, national origin, sexual orientation, age, citizenship, marital status, disability, gender identity or any other identifying characteristic are encouraged to apply.Our True Blue team consists of individuals from all backgrounds who contribute diverse perspectives and experiences to Ledcor. We are committed to continuing to build on our culture of empowerment, inclusion and belonging. Date PostedSep 10, 2021 1067 West Cordova Street, Vancouver, BC, Canada\n\n                    Category\n Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Vancouver, BC", " Full Time", " Information Technology"]}, {"title": "Release QA Specialist", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionOur Release QA team in Burnaby has over 130 staff and are responsible for ensuring Fortinet products meet the high standards we expect before release to the market. We are currently recruiting for teams focused on QA activities for our FortiOS, FortiManager, FortiAnalyzer and FortiClient products. Technical Job Duties:   •Execute regression testing on products using a combination of manual and auto testing techniques. Create, maintain, and execute test specifications and test cases  •Write and maintain automation scripts  •Identify, document, and track software defects found during testing  •Work closely with developers to ensure defects are correctly identified and fixed  Writing Job Duties:   •Work closely with Developers, QA, Product Managers, and others to understand new features, use cases, and customer scenarios.  •Document & publish release notes, user guides, reference materials and use case scenarios for new product releases.  Job Experience Required:   •3 - 5 years of software testing experience.  •Solid understanding of TCP/IP, routing, DNS, DHCP, routing and switching  •Working experience on Virtual machine environment, i.e VMware / ESXi, Hypervisor  •Demonstrated knowledge of firewalls, Linux, Sniff, or Ethereal  •Strong knowledge of IPSec, SSL VPN, data encryption and authentication  •Knowledge of general QA procedures and methodologies, as well as software development fundamentals  •Experience configuring, installing, and troubleshooting PC/server software and hardware in a Windows and Unix environment  •Demonstrated ability to logically and analytically troubleshoot software  •Ability to work in a collaborative environment and communicate well with other departments  •Ability to work on assigned tasks under tight time constraints  •Demonstrated ability to write clear and reproducible problem reports, and test results  •Demonstrated skills in scripting languages, such as shell, TCL, PERL or Python are considered assets  •Demonstrated writing skills.  •Knowledge of database is considered an asset  •Knowledge of JSON API is considered an asset  Educational Requirement:   •A degree or technical diploma in Computer Science, Computer Technology, or related field  #LI-HP1 #GD\n\n                    Category\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}, {"title": "Software Developer (C/C++)", "company": "Fortinet", "date": "Mar. 24, 2024", "location": "<br/>\nBurnaby, BC<br/>\n</div>", "descrip": "\nDescriptionFortinet team has a great career opportunity for a C/C++ Software Developer within its FortiClient EMS team. Our ideal candidate should be experienced, smart and eager to learn. FortiClient's Security Fabric Integration provides endpoint visibility through telemetry and ensures that all fabric components - FortiGate, FortiAnalyzer, EMS, Managed AP, Managed Switches, and Sandbox - have a unified view of endpoints in order to provide tracking and awareness, compliance enforcement, and reporting. Fortinet extends ZTNA control to end-user devices both on- and off-network operation through FortiClient. Easy to use Secure Remote Access and Mobility via SSL and IPsec VPN. FortiClient connects every endpoint to form a cohesive security fabric.  Job Responsibilities:   •Design, Implementation and maintenance of the FortiClient EMS services (server side)   Skills Required:   •Experience with C/C++ programming in Microsoft Windows and Linux development environments  •Experience in multi-threaded, high performance server side code designs  •Experience in network programing  •Experience in relational databases, such as MS SQL, MySQL, PostgreSQL  •Excellent problem solving and troubleshooting skills  •Must be able to work well in a team development environment  •Experience in the following is a plus: C#, GoLang, Python  Educational Requirements:   •Degree, diploma or masters in Computer Science or Software Engineering disciplines or relevant years of related experience in similar domain  •Minimum 2+ years in software development experience  #GD #LI-AV1\n\n                    Category\n Software and Programming Information Technology\n", "details": ["\n\n                                6 days ago\n                            ", " Burnaby, BC", " Full Time", " Software and Programming", " Information Technology"]}]}